Repository: owasp-russia/top-10-proactive-controls
Catalog: source/locales/*/LC_MESSAGES/c1-security-requirements.po
Languages: ru

source: C1: Define Security Requirements
ru: C1: Определение требований безопасности

source: Description
ru: Описание

source: A security requirement is a statement of needed security functionality that ensures one of many different security properties of software is being satisfied. Security requirements are derived from industry standards, applicable laws, and a history of past vulnerabilities. Security requirements define new features or additions to existing features to solve a specific security problem or eliminate a potential vulnerability.
ru: Требования безопасности описывают функции, которые необходимо реализовать для обеспечения определенных параметров безопасности ПО. Требования безопасности составляются на основе промышленных стандартов, действующих законов и данных об обнаруженных уязвимостях. Требования безопасности определяют функции, которые необходимо разработать или доработать для решения определенных проблем с безопасностью или устранения потенциальных угроз.

source: Security requirements provide a foundation of vetted security functionality for an application. Instead of creating a custom approach to security for every application, standard security requirements allow developers to reuse the definition of security controls and best practices. Those same vetted security requirements provide solutions for security issues that have occurred in the past. Requirements exist to prevent the repeat of past security failures.
ru: Требования безопасности содержат проверенные методы обеспечения безопасности приложений. Вместо создания собственных решений для каждого приложения, разработчики могут воспользоваться стандартными требованиями с описанными в них настройками безопасности и рекомендациями. Эти методы основаны на решениях проблем с безопасностью, имевших место в прошлом. Требования нацелены на предотвращение повторного возникновения аналогичных проблем с безопасностью.

source: The OWASP ASVS
ru: OWASP ASVS

source: The `OWASP Application Security Verification Standard (ASVS) <https://www.owasp.org/index.php/Category:OWASP_Application_Security_Verification_Standard_Project>`_ is a catalog of available security requirements and verification criteria. OWASP ASVS can be a source of detailed security requirements for development teams.
ru: `Стандарт подтверждения безопасности приложений OWASP (ASVS) <https://www.owasp.org/index.php/Category:OWASP_Application_Security_Verification_Standard_Project>`_ представляет собой каталог доступных требований безопасности и параметров проверки. OWASP ASVS может служить источником расширенных требований безопасности для команд разработчиков.

source: Security requirements are categorized into different buckets based on a shared higher order security function. For example, the ASVS contains categories such as authentication, access control, error handling / logging, and web services. Each category contains a collection of requirements that represent the best practices for that category drafted as verifiable statements.
ru: Требования безопасности объединены в категории на основе общих функций безопасности высшего порядка. Например, ASVS содержит следующие категории: аутентификация, контроль доступа, обработка и журналирование ошибок, а также веб-службы. Каждая категория содержит перечень требований, представляющих собой рекомендации для данной категории в виде списка проверяемых параметров.

source: Augmenting Requirements with User Stories and Misuse Cases
ru: Дополнение требований на основе сценариев эксплуатации и случаев неправомерного использования

source: The ASVS requirements are basic verifiable statements which can be expanded upon with user stories and misuse cases. The advantage of a user story or misuse case is that it ties the application to exactly what the user or attacker does to the system, versus describing what the system offers to the user.
ru: Требования ASVS описывают основные параметры проверок, которые могут быть расширены на основе сценариев эксплуатации заказчика или случаев неправомерного использования приложения. Преимущество данного подхода заключается в том, что он позволяет связать реальные сценарии использования приложения заказчиком или злоумышленником с тем, что система предлагает пользователю.

source: Here is an example of expanding on an ASVS 3.0.1 requirement. From the "Authentication Verification Requirements" section of ASVS 3.0.1, requirement 2.19 focuses on default passwords.
ru: Ниже представлен пример расширения требования ASVS 3.0.1. Пункт 2.19 раздела "Требования проверки аутентификации" ASVS 3.0.1 посвящен паролям по умолчанию:

source: 2.19 Verify there are no default passwords in use for the application framework or any components used by the application (such as "admin/password").
ru: 2.19 Удостоверьтесь в том, что пароли, задаваемые по умолчанию (например, "admin/password"), не используются для фреймворка приложения или в каком-либо из компонентов приложения.

source: This requirement contains both an action to verify that no default passwords exist, and also carries with it the guidance that no default passwords should be used within the application.
ru: Данное требование описывает проверку на отсутствия паролей по умолчанию и запрет на использование паролей по умолчанию в приложении.

source: A user story focuses on the perspective of the user, administrator, or attacker of the system, and describes functionality based on what a user wants the system to do for them. A user story takes the form of "As a user, I can do x, y, and z".
ru: Сценарий эксплуатации приложения предполагает наличие пользователя, администратора или злоумышленника, а также описывает функциональные возможности системы на основе ожиданий пользователя. Сценарий эксплуатации заказчика представляется в следующей форме: "В качестве пользователя я могу выполнить x, y и z".

source: As a user, I can enter my username and password to gain access to the application.
ru: В качестве пользователя, для получения доступа к приложению, я могу ввести имя пользователя и пароль.

source: As a user, I can enter a long password that has a maximum of 1023 characters.
ru: В качестве пользователя я могу ввести длинный пароль, не превышающий 1023 символов.

source: When the story is focused on the attacker and their actions, it is referred to as a misuse case.
ru: Сценарии, описывающие злоумышленников и их действия, называются случаями неправомерного использования.

source: As an attacker, I can enter in a default username and password to gain access.
ru: В качестве злоумышленника, для получения доступа, я могу ввести имя пользователя и пароль, задаваемые по умолчанию.

source: This story contains the same message as the traditional requirement from ASVS, with additional user or attacker details to help make the requirement more testable.
ru: Данный сценарий похож на традиционное требование ASVS, но содержит дополнительную информацию о пользователе или злоумышленнике, облегчающую проверку реализации требования.

source: Implementation
ru: Реализация

source: Successful use of security requirements involves four steps. The process includes discovering / selecting, documenting, implementing, and then confirming correct implementation of new security features and functionality within an application.
ru: Процесс успешного применения требований безопасности включает в себя четыре этапа: поиск и выбор, документирование, реализация, подтверждение правильности реализации новых функций безопасности и функциональности приложения.

source: Discovery and Selection
ru: Поиск и выбор

source: The process begins with discovery and selection of security requirements. In this phase, the developer is understanding security requirements from a standard source such as ASVS and choosing which requirements to include for a given release of an application. The point of discovery and selection is to choose a manageable number of security requirements for this release or sprint, and then continue to iterate for each sprint, adding more security functionality over time.
ru: Процесс начинается с поиска и отбора требований безопасности. На этом этапе разработчик изучает информацию, представленную в стандартных источниках, например, ASVS, и выбирает требования, которые будут включены в одну из версий приложения. Цель данного этапа заключается в выборе реализуемого количества требований безопасности, которые могут быть добавлены в рамках отдельного релиза или спринта. Для каждого последующего спринта процесс повторяется, и все больше функций безопасности внедряется в приложение.

source: Investigation and Documentation
ru: Исследование и документирование

source: During investigation and documentation, the developer reviews the existing application against the new set of security requirements to determine whether the application currently meets the requirement or if some development is required. This investigation culminates in the documentation of the results of the review.
ru: На этапе исследования и документирования разработчик проверяет приложение на соответствие новому набору требований безопасности, а в случае несоответствия определяет объем необходимых доработок. Исследование завершается документированием результатов проверки.

source: Implementation and Test
ru: Реализация и тестирование

source: After the need is determined for development, the developer must now modify the application in some way to add the new functionality or eliminate an insecure option. In this phase the developer first determines the design required to address the requirement, and then completes the code changes to meet the requirement. Test cases should be created to confirm the existence of the new functionality or disprove the existence of a previously insecure option.
ru: После определения объема доработок, разработчику необходимо модифицировать приложение для добавления новых или удаления небезопасных функций. На этом этапе разработчик сначала создает проект выполнения требования, а затем вносит изменения в код для его реализации. Для подтверждения наличия новой функции или отсутствия присутствовавшего ранее небезопасного параметра необходимо провести тестирование.

source: Vulnerabilities Prevented
ru: Предотвращаемые уязвимости

source: Security requirements define the security functionality of an application. Better security built in from the beginning of an applications life cycle results in the prevention of many types of vulnerabilities.
ru: Требования безопасности определяют безопасность приложения. Функции обеспечения безопасности, реализуемые в приложении с самого начала его жизненного цикла, помогут предотвратить большое количество различных уязвимостей.

source: References
ru: Ссылки

source: `OWASP Application Security Verification Standard (ASVS) <https://www.owasp.org/index.php/Category:OWASP_Application_Security_Verification_Standard_Project>`_
ru: `Стандарт подтверждения безопасности приложений OWASP (ASVS) <https://www.owasp.org/index.php/Category:OWASP_Application_Security_Verification_Standard_Project>`_

source: `OWASP Mobile Application Security Verification Standard (MASVS) <https://github.com/OWASP/owasp-masvs>`_
ru: `Стандарт подтверждения безопасности мобильных приложений OWASP (MASVS <https://github.com/OWASP/owasp-masvs>`_

source: `OWASP Top Ten <https://www.owasp.org/index.php/Category:OWASP_Top_Ten_Project>`_
ru: `Топ-10 OWASP <https://www.owasp.org/index.php/Category:OWASP_Top_Ten_Project>`_
