Repository: owasp-russia/top-10-proactive-controls
Catalog: source/locales/*/LC_MESSAGES/c10-handle-errors-exceptions.po
Languages: ru

source: C10: Handle all Errors and Exceptions
ru: C10: Обязательная обработка всех ошибок и исключений

source: Description
ru: Описание

source: Exception handling is a programming concept that allows an application to respond to different error states (like network down, or database connection failed, etc) in various ways. Handling exceptions and errors correctly is critical to making your code reliable and secure.
ru: Обработка исключений позволяет приложению реагировать на различные ошибки (например, сбой сети или подключения к базе данных) различными способами. Корректная обработка исключений и ошибок просто необходима для обеспечения надежности и безопасности вашего кода.

source: Error and exception handling occurs in all areas of an application including critical business logic as well as security features and framework code.
ru: Ошибки и исключения обрабатываются на всех уровнях приложения, включая критическую бизнес-логику, функции безопасности и фреймворки.

source: Error handling is also important from an intrusion detection perspective. Certain attacks against your application may trigger errors which can help detect attacks in progress.
ru: Обработка ошибок также важна с точки зрения обнаружения атак. Некоторые атаки на приложения могут вызывать ошибки, позволяющие обнаружить атаку в процессе ее проведения.

source: Error Handling Mistakes
ru: Некорректная обработка ошибок

source: Researchers at the University of Toronto have found that even small mistakes in error handling or forgetting to handle errors can lead to `catastrophic failures in distributed systems <https://www.usenix.org/system/files/conference/osdi14/osdi14-paper-yuan.pdf>`_.
ru: Исследователи из Университета Торонто выяснили, что даже небольшая оплошность при обработке ошибок или их игнорирование может привести к `критическим сбоям в работе распределенных систем <https://www.usenix.org/system/files/conference/osdi14/osdi14-paper-yuan.pdf>`_.

source: Mistakes in error handling can lead to different kinds of security vulnerabilities.
ru: Некорректная обработка ошибок может стать причиной различных уязвимостей.

source: **Information leakage**: Leaking sensitive information in error messages can unintentionally help attackers. For example, an error that returns a stack trace or other internal error details can provide an attacker with information about your environment. Even small differences in handling different error conditions (e.g., returning "invalid user" or "invalid password" on authentication errors) can provide valuable clues to attackers. As described above, be sure to log error details for forensics and debugging purposes, but don’t expose this information, especially to an external client.
ru: **Утечка данных**: разглашение конфиденциальной информации в сообщениях об ошибках может непреднамеренно помочь злоумышленникам. Например, сообщение, содержащее трассировку стека или подробности внутренней ошибки, может предоставить злоумышленнику данные о вашем окружении. Даже небольшие различия в обработке ошибок (например, сообщение о вводе некорректного имени пользователя или некорректного пароля при ошибке аутентификации) могут стать для атакующего источником важной информации. Как описывалось выше, необходимо обеспечить подробное журналирование ошибок для проведения расследований и отладки, но избегать разглашения этих данных, особенно внешним клиентам.

source: **TLS bypass**: The `Apple goto "fail bug" <https://www.dwheeler.com/essays/apple-goto-fail.html>`_ was a control-flow error in error handling code that lead to a complete compromise of TLS connections on apple systems.
ru: **Обход защиты TLS**: уязвимость `Apple "goto fail" <https://www.dwheeler.com/essays/apple-goto-fail.html>`_ была следствием ошибки управления в коде обработки ошибок, которая приводила к полной компрометации TLS-соединений систем Apple.

source: **DOS**: A lack of basic error handling can lead to system shutdown. This is usually a fairly easy vulnerability for attackers to exploit. Other error handling problems could lead to increased usage of CPU or disk in ways that could degrade the system.
ru: **Отказ в обслуживании**: отсутствие базовой обработки ошибок может привести к неработоспособности системы. Обычно это относительно простая в эксплуатации уязвимость. Другие проблемы с обработкой ошибок могут привести к повышенному использованию ресурсов ЦП или диска и таким образом ухудшить производительность системы.

source: Positive Advice
ru: Полезные советы

source: Manage exceptions in a `centralized manner <https://www.owasp.org/index.php/Error_Handling#Centralised_exception_handling_.28Struts_Example.29>`_ to avoid duplicated try/catch blocks in the code. Ensure that all unexpected behavior is correctly handled inside the application.
ru: Управляйте исключениями `централизованно <https://www.owasp.org/index.php/Error_Handling#Centralised_exception_handling_.28Struts_Example.29>`_, чтобы избежать дублирования блокировок try/catch в коде. Убедитесь в корректной обработке непредвиденных режимов работы внутри приложения.

source: Ensure that error messages displayed to users do not leak critical data, but are still verbose enough to enable the proper user response.
ru: Убедитесь в том, что выводимые сообщения об ошибках не содержат критичных данных, но при этом содержат достаточно информации для соответствующего реагирования на них.

source: Ensure that exceptions are logged in a way that gives enough information for support, QA, forensics or incident response teams to understand the problem.
ru: Обеспечьте журналирование исключений таким образом, чтобы специалисты из команды технической поддержки, контроля качества, расследования инцидентов или реагирования на атаки имели достаточно данных для решения проблемы.

source: Carefully test and verify error handling code.
ru: Тщательно протестируйте и проверьте код обработки ошибок.

source: References
ru: Ссылки

source: `OWASP Code Review Guide: Error Handling <https://www.owasp.org/index.php/Error_Handling>`_
ru: `Руководство OWASP по анализу кода: Обработка ошибок <https://www.owasp.org/index.php/Error_Handling>`_

source: `OWASP Testing Guide: Testing for Error Handling <https://www.owasp.org/index.php/Testing_for_Error_Handling>`_
ru: `Руководство OWASP по тестированию: Обработка ошибок <https://www.owasp.org/index.php/Testing_for_Error_Handling>`_

source: `OWASP Improper Error Handling <https://www.owasp.org/index.php/Improper_Error_Handling>`_
ru: `OWASP: Некорректная обработка ошибок <https://www.owasp.org/index.php/Improper_Error_Handling>`_

source: `CWE 209: Information Exposure Through an Error Message <https://cwe.mitre.org/data/definitions/209.html>`_
ru: `CWE-209: Разглашение информации в сообщениях об ошибках <https://cwe.mitre.org/data/definitions/209.html>`_

source: `CWE 391: Unchecked Error Condition <https://cwe.mitre.org/data/definitions/391.html>`_
ru: `CWE-391: Игнорирование ошибок <https://cwe.mitre.org/data/definitions/391.html>`_

source: Tools
ru: Инструменты

source: `Error Prone <http://errorprone.info/>`_ - A static analysis tool from Google to catch common mistakes in error handling for Java developers
ru: `Error Prone <http://errorprone.info/>`_ — инструмент от Google для статического анализа и поиска стандартных недостатков в обработке ошибок для Java-разработчиков.

source: One of the most famous automated tools for finding errors at runtime is `Netflix's Chaos Monkey <https://github.com/Netflix/SimianArmy>`_, which intentionally disables system instances to ensure that the overall service will recover correctly.
ru: `Chaos Monkey от Netflix <https://github.com/Netflix/SimianArmy>`_ — один из наиболее известных автоматических инструментов для поиска ошибок в запущенном приложении, который намеренно отключает компоненты системы, чтобы подтвердить корректность восстановления работоспособности всей службы.
