Repository: owasp-russia/top-10-proactive-controls
Catalog: source/locales/*/LC_MESSAGES/c2-leverage-security-frameworks-libraries.po
Languages: ru

source: C2: Leverage Security Frameworks and Libraries
ru: C2: Использование безопасных фреймворков и библиотек

source: Description
ru: Описание

source: Secure coding libraries and software frameworks with embedded security help software developers guard against security-related design and implementation flaws. A developer writing an application from scratch might not have sufficient knowledge, time, or budget to properly implement or maintain security features. Leveraging security frameworks helps accomplish security goals more efficiently and accurately.
ru: Безопасные библиотеки и фреймворки со встроенными функциями безопасности помогают разработчикам избежать появления уязвимостей на этапе разработки и реализации. Разработчики, создающие приложение с нуля, могут не иметь достаточных знаний, времени или средств для реализации или поддержания безопасности приложения. Использование безопасных фреймворков позволяет добиваться безопасности приложений более эффективно.

source: Implementation Best Practices
ru: Рекомендации по реализации

source: When incorporating third party libraries or frameworks into your software, it is important to consider the following best practices:
ru: При включении сторонних библиотек или фреймворков в свое ПО необходимо учитывать следующие рекомендации:

source: Use libraries and frameworks from trusted sources that are actively maintained and widely used by many applications.
ru: используйте библиотеки и фреймворки из доверенных источников, которые активно разрабатываются и широко применяются в приложениях;

source: Create and maintain an inventory catalog of all the third party libraries.
ru: составьте и поддерживайте в актуальном состоянии каталог всех сторонних библиотек;

source: Proactively keep libraries and components up to date. Use a tool like `OWASP Dependency Check <https://www.owasp.org/index.php/OWASP_Dependency_Check>`_ and `Retire.JS <https://retirejs.github.io/retire.js/>`_ to identify project dependencies and check if there are any known, publicly disclosed vulnerabilities for all third party code.
ru: своевременно обновляйте библиотеки и компоненты. Используйте инструменты, такие как `Проверки зависимостей OWASP <https://www.owasp.org/index.php/OWASP_Dependency_Check>`_ и `Retire.JS <https://retirejs.github.io/retire.js/>`_, для определения зависимостей в проектах, а также проверяйте наличие известных и опубликованных уязвимостей в стороннем коде;

source: Reduce the attack surface by encapsulating the library and expose only the required behaviour into your software.
ru: для снижения вероятности атак используйте инкапсуляцию библиотек и только необходимую для вашего ПО функциональность.

source: Vulnerabilities Prevented
ru: Предотвращаемые уязвимости

source: Secure frameworks and libraries can help to prevent a wide range of web application vulnerabilities. It is critical to keep these frameworks and libraries up to date as described in the `using components with known vulnerabilities Top Ten 2017 risk <https://www.owasp.org/index.php/Category:OWASP_Top_Ten_Project>`_.
ru: Использование безопасных фреймворков и библиотек поможет избежать большого количество уязвимостей в веб-приложениях. Очень важно поддерживать эти фреймворки и библиотеки в актуальном состоянии, см. раздел об `использовании компонентов с известными уязвимостями в Топ-10 2017 <https://www.owasp.org/index.php/Category:OWASP_Top_Ten_Project>`_.

source: Tools
ru: Инструменты

source: `OWASP Dependency Check <https://www.owasp.org/index.php/OWASP_Dependency_Check>`_ - identifies project dependencies and checks for publicly disclosed vulnerabilities
ru: `Проверки зависимостей OWASP <https://www.owasp.org/index.php/OWASP_Dependency_Check>`_ — определяют зависимости в проектах и проверяют наличие общеизвестных уязвимостей.

source: `Retire.JS <http://retirejs.github.io/retire.js/>`_ scanner for JavaScript libraries
ru: `Retire.JS <http://retirejs.github.io/retire.js/>`_ — сканер библиотек JavaScript.
