Repository: owasp-russia/top-10-proactive-controls
Catalog: source/locales/*/LC_MESSAGES/c3-secure-database-access.po
Languages: ru

source: C3: Secure Database Access
ru: C3: Обеспечение безопасного доступа к базам данных

source: Description
ru: Описание

source: This section describes secure access to all data stores, including both relational databases and NoSQL databases. Some areas to consider:
ru: Данный раздел посвящен обеспечению безопасного доступа ко всем хранилищам данных, включая реляционные базы данных и базы данных NoSQL. Рассматриваются следующие вопросы:

source: Secure queries
ru: Безопасность запросов

source: Secure configuration
ru: Безопасность конфигурации

source: Secure authentication
ru: Безопасность аутентификации

source: Secure communication
ru: Безопасность соединений

source: Secure Queries
ru: Безопасность запросов

source: SQL Injection occurs when untrusted user input is dynamically added to a SQL query in an insecure manner, often via basic string concatenation. SQL Injection is one of the most dangerous application security risks. SQL Injection is easy to exploit and could lead to the entire database being stolen, wiped, or modified. The application can even be used to run dangerous commands against the operating system hosting your database, thereby giving an attacker a foothold on your network.
ru: SQL-код может быть внедрен, если непроверенные входные данные динамически добавляются в SQL-запросы, обычно путем присоединения к основной строке. Внедрение SQL-кода представляет одну из наиболее серьезных угроз безопасности приложения. Внедрение SQL-кода легко осуществить; эксплуатация данной уязвимости может привести к краже, удалению или изменению баз данных. Приложение также может быть использовано для выполнения вредоносных команд в системе, содержащей вашу базу данных, таким образом позволяя злоумышленнику закрепиться в сети.

source: In order to mitigate SQL injection, untrusted input should be prevented from being interpreted as part of a SQL command. The best way to do this is with the programming technique known as 'Query Parameterization'. This defense should be applied to SQL, OQL, as well as stored procedure construction.
ru: Для предотвращения SQL-внедрений необходимо избегать интерпретации непроверенных входных данных в составе SQL-команд. Наилучшим решением будет использование метода "параметризации запросов". Этот метод необходимо применять к конструкциям SQL и OQL, а также хранимым процедурам.

source: A good list of query parameterization examples in ASP, ColdFusion, C#, Delphi, .NET, Go, Java, Perl, PHP, PL/SQL, PostgreSQL, Python, R, Ruby and Scheme can be found at http://bobby-tables.com and the OWASP Cheat Sheet on Query Parameterization.
ru: Примеры параметризации запросов для ASP, ColdFusion, C#, Delphi, .NET, Go, Java, Perl, PHP, PL/SQL, PostgreSQL, Python, R, Ruby и Scheme можно найти на сайте http://bobby-tables.com и в памятке OWASP по параметризации запросов.

source: Caution on Query Parameterization
ru: Примечание о параметризации запросов

source: Certain locations in a database query are not parameterizable. These locations are different for each database vendor. Be certain to do very careful exact-match validation or manual escaping when confronting database query parameters that cannot be bound to a parameterized query. Also, while the use of parameterized queries largely has a positive impact on performance, certain parameterized queries in specific database implementations will affect performance negatively. Be sure to test queries for performance; especially complex queries with extensive like clause or text searching capabilities.
ru: Некоторые области запросов к базам данных (БД) нельзя параметризировать. Эти области отличаются в зависимости от вендора БД. Внимательно выполняйте проверку точных совпадений или ручную очистку при работе с параметрами запросов к БД, которые не могут быть привязаны к параметризованному запросу. Использование параметризованных запросов обычно положительно сказывается на производительности, однако некоторые запросы в определенных реализациях баз данных могут оказать негативное воздействие на производительность. Обязательно тестируйте влияние запросов на производительность, особенно комплексных запросов с поддержкой развернутых выражений LIKE или текстового поиска.

source: Secure Configuration
ru: Безопасность конфигурации

source: Unfortunately, database management systems do not always ship in a "secure by default" configuration. Care must be taken to ensure that the security controls available from the Database Management System (DBMS) and hosting platform are enabled and properly configured. There are standards, guides, and benchmarks available for most common DBMS.
ru: К сожалению, системы управления базами данных (СУБД) не всегда имеют безопасную конфигурацию по умолчанию. Необходимо убедиться в том, что имеющиеся средства обеспечения безопасности СУБД и платформы, на которой она установлена, используются и настроены корректно. Для большинства распространенных СУБД доступны стандарты, руководства и тесты производительности.

source: Secure Authentication
ru: Безопасность аутентификации

source: All access to the database should be properly authenticated. Authentication to the DBMS should be accomplished in a secure manner. Authentication should take place only over a secure channel. Credentials must be properly secured and available for use.
ru: Любой доступ к базам данных необходимо контролировать должным образом. Аутентификация доступа к СУБД должна выполняться безопасно и только по защищенному каналу. Также необходимо обеспечить безопасность и доступность учетных данных.

source: Secure Communication
ru: Безопасность соединений

source: Most DBMS support a variety of communications methods (services, APIs, etc) - secure (authenticated, encrypted) and insecure (unauthenticated or unencrypted). It is a good practice to only use the secure communications options per the Protect Data Everywhere control.
ru: Большинство СУБД поддерживают несколько способов связи (например, через службы или API), которые могут быть безопасными (аутентифицированными, зашифрованными) и небезопасными (неаутентифицированными или незашифрованными). Рекомендуется использовать только безопасные методы связи, как это описано в разделе "Повсеместная защита данных".

source: Vulnerabilities Prevented
ru: Предотвращаемые уязвимости

source: OWASP Top 10 2017- A1: Injection
ru: Топ-10 OWASP 2017 - A1: Внедрение

source: OWASP Mobile Top 10 2014-M1 Weak Server Side Controls
ru: Топ-10 OWASP 2014 (мобильные устройства) - M1: Ненадежные настройки на стороне сервера

source: References
ru: Ссылки

source: OWASP Cheat Sheet: Query Parameterization
ru: Памятка OWASP: Параметризация запросов

source: Bobby Tables: A guide to preventing SQL injection
ru: Bobby Tables: Руководство по предотвращению внедрений SQL-кода

source: CIS Database Hardening Standards
ru: Стандарты CIS по улучшению безопасности баз данных
