Repository: owasp-russia/top-10-proactive-controls
Catalog: source/locales/*/LC_MESSAGES/c4-encode-escape-data.po
Languages: ru

source: C4: Encode and Escape Data
ru: C4: Кодирование и экранирование данных

source: Description
ru: Описание

source: **Encoding** and escaping are defensive techniques meant to stop injection attacks. Encoding (commonly called "Output Encoding") involves translating special characters into some different but equivalent form that is no longer dangerous in the target interpreter, for example translating the ``<`` character into the ``&lt;`` string when writing to an HTML page. **Escaping** involves adding a special character before the character/string to avoid it being misinterpreted, for example, adding a ``\`` character before a ``"`` (double quote) character so that it is interpreted as text and not as closing a string.
ru: **Кодирование** и экранирование являются методами защиты от внедрения кода. Кодирование (обычно называемое "кодированием выходных данных") представляет собой преобразование специальных символов в эквивалентные, не опасные для интерпретатора комбинации, например, преобразование символа ``<`` в сочетание ``&lt;`` при его добавлении на HTML-страницу. **Экранирование** заключается в добавлении спецсимволов перед символами или строками для предотвращения их некорректной интерпретации, например, добавление символа ``\`` перед ``"`` (двойными кавычками) позволяет интерпретировать их в качестве части текста, а не в качестве обозначения окончания строки.

source: Output encoding is best applied **just before** the content is passed to the target interpreter. If this defense is performed too early in the processing of a request then the encoding or escaping may interfere with the use of the content in other parts of the program. For example if you HTML escape content before storing that data in the database and the UI automatically escapes that data a second time then the content will not display properly due to being double escaped.
ru: Кодирование лучше всего применять **непосредственно перед** передачей данных интерпретатору. Если применить данный метод на слишком раннем этапе обработки запроса, то кодирование или экранирование может сказаться на использование контента в других частях программы. Например, если при перед сохранением в базе данных HTML-контент экранируется, а интерфейс автоматически экранирует эти данные еще раз, то содержимое не будет отображаться корректно из-за двойного экранирования.

source: Contextual Output Encoding
ru: Контекстуальное кодирование выходных данных

source: Contextual output encoding is a crucial security programming technique needed to stop XSS. This defense is performed on output, when you're building a user interface, at the last moment before untrusted data is dynamically added to HTML. The type of encoding will depend on the location (or context) in the document where data is being displayed or stored. The different types of encoding that would be used for building secure user interfaces includes HTML Entity Encoding, HTML Attribute Encoding, JavaScript Encoding, and URL Encoding.
ru: Контекстуальное кодирование выходных данных является ключевым для безопасного программирования и предотвращения межсайтового выполнения сценариев. Подобная мера защиты применяется при создании интерфейсов пользователя, непосредственно перед динамическим добавлением непроверенных данных к HTML-коду. Тип кодирования будет зависеть от места (или контекста) отображения или хранения данных в документе. Типы кодирования, рекомендуемые к использованию при создании безопасного интерфейса: кодирование сущностей или атрибутов HTML, а также кодирование JavaScript и URL.

source: Java Encoding Examples
ru: Примеры кодирования Java

source: For examples of the OWASP Java Encoder providing contextual output encoding see: `OWASP Java Encoder Project Examples <https://www.owasp.org/index.php/OWASP_Java_Encoder_Project#tab=Use_the_Java_Encoder_Project>`_.
ru: Примеры использования кодировщика Java, обеспечивающего контекстуальное кодирование выходных данных, можно посмотреть на `сайте проекта кодировщика Java от OWASP <https://www.owasp.org/index.php/OWASP_Java_Encoder_Project#tab=Use_the_Java_Encoder_Project>`_.

source: .NET Encoding Examples
ru: Примеры кодирования .NET

source: Starting with .NET 4.5 , the Anti-Cross Site Scripting library is part of the framework, but not enabled by default. You can specify to use AntiXssEncoder from this library as the default encoder for your entire application using the web.conf settings. When applied is important to contextual encode your output - that means to use the right function from the AntiXSSEncoder library for the appropriate location of data in document.
ru: Начиная с .NET 4.5, библиотека антимежсайтового выполнения сценариев является частью фреймворка, но не используется по умолчанию. Вы можете назначить AntiXssEncoder из этой библиотеки в качестве стандартного кодировщика вашего приложения, изменив настройки web.conf. При кодировании выходных данных необходимо учитывать контекст, т. е. использовать соответствующую функцию из библиотеки AntiXSSEncoder в зависимости от расположения данных в документе.

source: PHP Encoding Examples
ru: Примеры кодирования PHP

source: In Zend Framework 2 (ZF2), ``Zend\Escaper`` can be used for encoding the output. For contextual encoding examples see `Context-specific escaping with zend-escaper <https://framework.zend.com/blog/2017-05-16-zend-escaper.html>`_.
ru: В Zend Framework 2 (ZF2) для кодирования выходных данных может быть использован Zend\Escaper. Примеры контекстного кодирования можно посмотреть на странице, посвященной `контекстному экранированию с помощью zend-escaper <https://framework.zend.com/blog/2017-05-16-zend-escaper.html>`_.

source: Other Types of Encoding and Injection Defense
ru: Другие способы кодирования и защиты от внедрений

source: Encoding/Escaping can be used to neutralize content against other forms of injection. For example, it's possible to neutralize certain special meta-characters when adding input to an operating system command. This is called "OS command escaping", "shell escaping", or similar. This defense can be used to stop "Command Injection" vulnerabilities.
ru: Кодирование или экранирование может быть использовано для предотвращения других форм внедрений в контент. Например, можно нейтрализовывать некоторые специальные метасимволы при вводе данных для системных команд. Это называют "экранированием команд ОС", "экранированием shell" и т. п. Подобная защита может быть использована для предотвращения "Внедрения команд".

source: There are other forms of escaping that can be used to stop injection such as XML attribute escaping stopping various forms of XML and XML path injection, as well as LDAP distinguished name escaping that can be used to stop various forms of LDAP injection.
ru: Существуют и другие формы экранирования, которые могут быть использованы для предотвращения внедрений, например, экранирование атрибутов XML, защищающее от различных форм внедрений XML и XML-путей, а также экранирование уникальных имен LDAP, позволяющее предотвратить различные LDAP-внедрения.

source: Character Encoding and Canonicalization
ru: Нормализация и кодировка символов

source: Unicode Encoding is a method for storing characters with multiple bytes. Wherever input data is allowed, data can be entered using `Unicode <https://www.owasp.org/index.php/Unicode_Encoding>`_ to disguise malicious code and permit a variety of attacks. `RFC 2279 <https://tools.ietf.org/html/rfc2279>`_ references many ways that text can be encoded.
ru: Кодировка Юникод — это способ хранения символов с использованием нескольких байтов. При вводе данных злоумышленник может использовать `Юникод <https://www.owasp.org/index.php/Unicode_Encoding>`_, чтобы скрыть вредоносный код и получить возможность проведения различных атак. `RFC 2279 <https://tools.ietf.org/html/rfc2279>`_ описывает несколько способов кодировки текста.

source: Canonicalization is a method in which systems convert data into a simple or standard form. Web applications commonly use character canonicalization to ensure all content is of the same character type when stored or displayed.
ru: Нормализация — это способ преобразования данных в простую или стандартную форму. В веб-приложениях нормализацию обычно используют для обеспечения единообразия символов всего контента при его хранении или отображении.

source: To be secure against canonicalization related attacks means an application should be safe when malformed Unicode and other malformed character representations are entered.
ru: Защищенность от атак, связанных с нормализацией, означает отсутствие угроз безопасности приложения при вводе злоумышленником некорректно сформированных символов Юникода или любых других специально сформированных символов.

source: Vulnerabilities Prevented
ru: Предотвращаемые уязвимости

source: `OWASP Top 10 2017 - A1: Injection <https://www.owasp.org/index.php/Top_10-2017_A1-Injection>`_
ru: `Топ-10 OWASP 2017 - A1: Внедрение <https://www.owasp.org/index.php/Top_10-2017_A1-Injection>`_

source: `OWASP Top 10 2017 - A7: Cross Site Scripting (XSS) <https://www.owasp.org/index.php/Top_10-2017_A7-Cross-Site_Scripting_(XSS)>`_
ru: `Топ-10 OWASP 2017 - А7: Межсайтовое выполнение сценариев (XSS) <https://www.owasp.org/index.php/Top_10-2017_A7-Cross-Site_Scripting_(XSS)>`_

source: `OWASP Mobile_Top_10_2014-M7 Client Side Injection <https://www.owasp.org/index.php/Mobile_Top_10_2014-M7>`_
ru: `Топ-10 OWASP 2014 (мобильные устройства) - M7: Внедрение на стороне клиента <https://www.owasp.org/index.php/Mobile_Top_10_2014-M7>`_

source: References
ru: Ссылки

source: `XSS <https://www.owasp.org/index.php/Cross-site_Scripting_(XSS)>`_ - General information
ru: `Межсайтовое выполнение сценариев <https://www.owasp.org/index.php/Cross-site_Scripting_(XSS)>`_ — общие сведения

source: `OWASP Cheat Sheet: XSS Prevention <https://www.owasp.org/index.php/XSS_(Cross_Site_Scripting)_Prevention_Cheat_Sheet>`_ - Stopping XSS in your web application
ru: `Памятка OWASP: Предотвращение межсайтового выполнения сценариев (XSS) <https://www.owasp.org/index.php/XSS_(Cross_Site_Scripting)_Prevention_Cheat_Sheet>`_ — предотвращение XSS в веб-приложениях

source: `OWASP Cheat Sheet: DOM based XSS Prevention <https://www.owasp.org/index.php/DOM_based_XSS_Prevention_Cheat_Sheet>`_
ru: `Памятка OWASP: Предотвращение межсайтового выполнения сценариев на основе объектной модели документа <https://www.owasp.org/index.php/DOM_based_XSS_Prevention_Cheat_Sheet>`_

source: `OWASP Cheat Sheet: Injection Prevention <https://www.owasp.org/index.php/Injection_Prevention_Cheat_Sheet>`_
ru: `Памятка OWASP: Предотвращение внедрений <https://www.owasp.org/index.php/Injection_Prevention_Cheat_Sheet>`_

source: Tools
ru: Инструменты

source: `OWASP Java Encoder Project <https://www.owasp.org/index.php/OWASP_Java_Encoder_Project>`_
ru: `Проект кодировщика Java от OWASP <https://www.owasp.org/index.php/OWASP_Java_Encoder_Project>`_

source: `Zend\Escaper <https://framework.zend.com/blog/2017-05-16-zend-escaper.html>`_ - examples of contextual encodingx
ru: `Zend\Escaper <https://framework.zend.com/blog/2017-05-16-zend-escaper.html>`_ — примеры контекстного кодирования
