Repository: owasp-russia/top-10-proactive-controls
Catalog: source/locales/*/LC_MESSAGES/c5-validate-all-inputs.po
Languages: ru

source: C5: Validate All Inputs
ru: C5: Обязательная проверка всех входных данных

source: Description
ru: Описание

source: Input validation is a programming technique that ensures only properly formatted data may enter a software system component.
ru: Проверка входных данных является частью методики программирования, обеспечивающей попадание в компоненты программы только правильно отформатированных данных.

source: Syntax and Semantic Validity
ru: Синтаксическая и семантическая норма

source: An application should check that data is both syntactically and semantically valid (in that order) before using it in any way (including displaying it back to the user).
ru: Приложение должно проверять данные на соответствие синтаксической и семантической норме (именно в этом порядке) перед их использованием (включая отображение пользователю).

source: Syntax validity means that the data is in the form that is expected. For example, an application may allow a user to select a four-digit "account ID" to perform some kind of operation. The application should assume the user is entering a SQL injection payload, and should check that the data entered by the user is exactly four digits in length, and consists only of numbers (in addition to utilizing proper query parameterization).
ru: Синтаксическая норма означает соответствие данных ожидаемой форме представления. Например, в приложении пользователь может указывать четырехзначный "идентификатор" для выполнения некоторых операций. Злоумышленник может ввести данные, позволяющие ему внедрить SQL-код, поэтому приложение должно проверять, что вводимые данные представляют собой именно цифры и именно в количестве четырех символов (помимо использования соответствующей параметризации запросов).

source: Semantic validity includes only accepting input that is within an acceptable range for the given application functionality and context. For example, a start date must be before an end date when choosing date ranges.
ru: Семантическая норма означает использование только входных данных, не выходящих за рамки определенной функциональности и контекста. Например, при указании временных рамок дата начала должна предшествовать дате завершения.

source: Whitelisting vs Blacklisting
ru: Белые и черные списки

source: There are two general approaches to performing input syntax validation, commonly known as blacklisting and whitelisting:
ru: Существует два основных подхода к проверке синтаксиса входных данных, известные как черные и белые списки.

source: Blacklisting or blacklist validation attempts to check that given data does not contain "known bad" content. For example, a web application may block input that contains the exact text in order to help prevent XSS. However, this defense could be evaded with a lower case script tag or a script tag of mixed case.
ru: Черные списки или проверки по черному списку предназначены для поиска в данных "потенциально вредоносного" контента. Например, веб-приложение может блокировать входные данные, содержащие слово <SCRIPT>, с целью предотвращения межсайтового выполнения сценариев. Однако подобную меру защиты можно обойти, используя для тега script строчные буквы или комбинацию из строчных и прописных букв.

source: Whitelisting or whitelist validation attempts to check that a given data matches a set of "known good" rules. For example a whitelist validation rule for a US state would be a 2-letter code that is only one of the valid US states.
ru: Белые списки или проверки по белому списку предназначены для подтверждения соответствия данных требованиям набора "проверенных" правил. Например, проверка штата США по белому списку будет представлять собой поиск 2-буквенного кода в списке существующих штатов США.

source: When building secure software, whitelisting is the recommended minimal approach. Blacklisting is prone to error and can be bypassed with various evasion techniques and can be dangerous when depended on by itself. Even though blacklisting can often be evaded it can often useful to help detect obvious attacks. So while whitelisting helps limit the attack surface by ensuring data is of the right syntactic and semantic validity, blacklisting helps detect and potentially stop obvious attacks.
ru: При создании безопасного ПО как минимум рекомендуется использовать белые списки. Черные списки могут содержать ошибки, их можно обойти различными способами, а также они сами по себе могут представлять опасность. Несмотря на возможность обхода ограничений черных списков, они могут помочь обнаружить очевидные атаки. Таким образом, белые списки помогают ограничить возможность проведения атаки путем проверки соответствия данных синтаксической и семантической нормам, а черные списки помогают обнаружить и предотвратить очевидные атаки.

source: Client side and Server side Validation
ru: Проверки на стороне клиента и на стороне сервера

source: Input validation must always be done on the server-side for security. While client side validation can be useful for both functional and some security purposes it can often be easily bypassed. This makes server-side validation even more fundamental to security. For example, JavaScript validation may alert the user that a particular field must consist of numbers but the server side application must validate that the submitted data only consists of numbers in the appropriate numerical range for that feature.
ru: Для обеспечения безопасности, проверку входных данных необходимо всегда проводить на стороне сервера. Проверки на стороне клиента могут быть полезны с точки зрения функциональности и безопасности, но зачастую их легко обойти. Таким образом, проверка на стороне сервера является более предпочтительной для обеспечения безопасности. Например, проверка JavaScript может предупредить пользователя о том, что поле должно содержать только цифры, а вот приложение на стороне сервера должно подтвердить, что вводимые данные представляют собой числа в допустимом диапазоне значений.

source: Regular Expressions
ru: Регулярные выражения

source: Regular expressions offer a way to check whether data matches a specific pattern. Let’s start with a basic example.
ru: Регулярные выражения позволяют проверять данные на соответствие определенному шаблону. Начнем с простого примера.

source: The following regular expression is used to define a whitelist rule to validate usernames.
ru: Следующее регулярное выражение используется для определения белого списка имен пользователей.

source: This regular expression allows only lowercase letters, numbers and the underscore character. The username is also restricted to a length of 3 and 16 characters.
ru: Данное регулярное выражение допускает использование только строчных букв, цифр и символа подчеркивания. Длина имени пользователя также ограничивается 3–16 символами.

source: Caution: Potential for Denial of Service
ru: Внимание! Возможен отказ в обслуживании

source: Care should be exercised when creating regular expressions. Poorly designed expressions may result in potential denial of service conditions (aka ReDoS). Various tools can test to verify that regular expressions are not vulnerable to ReDoS.
ru: При создании регулярных выражений необходимо соблюдать осторожность. Плохо продуманные выражения могут привести к отказу в обслуживании (т. н. ReDoS — отказ в обслуживании из-за регулярных выражений). Для проверки регулярных выражений на ReDoS существует много разных инструментов.

source: Caution: Complexity
ru: Внимание! Сложность реализации

source: Regular expressions are just one way to accomplish validation. Regular expressions can be difficult to maintain or understand for some developers. Other validation alternatives involve writing validation methods programmatically which can be easier to maintain for some developers.
ru: Регулярные выражения — это всего лишь один из способов выполнения проверок. Некоторым разработчикам бывает сложно разобраться или работать с регулярными выражениями, поэтому создание программных методов проверки им кажется более простым.

source: Limits of Input Validation
ru: Ограничения проверок входных данных

source: Input validation does not always make data "safe" since certain forms of complex input may be "valid" but still dangerous. For example a valid email address may contain a SQL injection attack or a valid URL may contain a Cross Site Scripting attack. Additional defenses besides input validation should always be applied to data such as query parameterization or escaping.
ru: Проверка входных данных не всегда делает их "безопасными", поскольку некоторые сложные типы данных могут являться "допустимыми" и в то же время опасными. Например, допустимый адрес электронной почты может содержать вредоносный SQL-код, а допустимый URL-адрес может привести к межсайтовому выполнению сценариев. Помимо проверок входных данных необходимо использовать дополнительные меры защиты, например, экранирование или параметризацию запросов.

source: Challenges of Validating Serialized Data
ru: Проблемы проверки сериализованных данных

source: Some forms of input are so complex that validation can only minimally protect the application. For example, it's dangerous to deserialize untrusted data or data that can be manipulated by an attacker. The only safe architectural pattern is to not accept serialized objects from untrusted sources or to only deserialize in limited capacity for only simple data types. You should avoid processing serialized data formats and use easier to defend formats such as JSON when possible.
ru: Некоторые входные данные настолько сложные, что проверка может обеспечить лишь минимальную защиту приложения. Например, опасно десериализовывать непроверенные данные или данные, которые могут быть изменены злоумышленниками. Единственным безопасным решением будет отклонять сериализованные объекты от непроверенных источников или ограничивать десериализацию простыми типами данных. Необходимо избегать обработки сериализованных данных и использовать, по возможности, более простые с точки зрения обеспечения защиты форматы, такие как JSON.

source: If that is not possible then consider a series of validation defenses when processing serialized data.
ru: Если выше указанное невозможно, рекомендуется использовать серию проверок при обработке сериализованных данных.

source: Implement integrity checks or encryption of the serialized objects to prevent hostile object creation or data tampering.
ru: Реализуйте проверки целостности или шифрование сериализованных объектов для предотвращения создания вредоносных объектов или подмены данных.

source: Enforce strict type constraints during deserialization before object creation; typically code is expecting a definable set of classes. Bypasses to this technique have been demonstrated.
ru: Введите строгие ограничения типов при десериализации перед созданием объекта; обычно, ожидаемым является поддающийся определению набор классов. Методы обхода подобной защиты были представлены.

source: Isolate code that deserializes, such that it runs in very low privilege environments, such as temporary containers.
ru: Изолируйте код десериализации, чтобы он запускался в окружении с низким уровнем привилегий, например, во временных контейнерах.

source: Log security deserialization exceptions and failures, such as where the incoming type is not the expected type, or the deserialization throws exceptions.
ru: Обеспечьте журналирование исключений и ошибок десериализации, например, случаев непредусмотренных типов входных данных или исключений при десериализации.

source: Restrict or monitor incoming and outgoing network connectivity from containers or servers that deserialize.
ru: Ограничьте или контролируйте входящие и исходящие сетевые подключения контейнеров или серверов, осуществляющих десериализацию.

source: Monitor deserialization, alerting if a user deserializes constantly.
ru: Отслеживайте десериализацию, предупреждая о продолжительных фактах десериализации пользователем.

source: Unexpected User Input (Mass Assignment)
ru: Непредусмотренные входные данные (массовое назначение)

source: Some frameworks support automatic binding of HTTP requests parameters to server-side objects used by the application. This auto-binding feature can allow an attacker to update server-side objects that were not meant to be modified. The attacker can possibly modify their access control level or circumvent the intended business logic of the application with this feature.
ru: Некоторые фреймворки поддерживают автоматическую привязку параметров HTTP-запросов к серверным объектам, используемым приложением. Подобная функция автопривязки может позволить злоумышленникам обновить серверные объекты, не предназначенные для изменения. Используя данную функцию, атакующий может изменить свой уровень доступа или обойти бизнес-логику приложения.

source: This attack has a number of names including: mass assignment, autobinding and object injection.
ru: Данная атака имеет несколько названий, включая массовое назначение, автопривязку и внедрение объектов.

source: As a simple example, if the user object has a field privilege which specifies the user's privilege level in the application, a malicious user can look for pages where user data is modified and add privilege=admin to the HTTP parameters sent. If auto-binding is enabled in an insecure fashion, the server-side object representing the user will be modified accordingly.
ru: Простой пример: если объект пользователя имеет привилегию field, определяющую уровень привилегий пользователя в приложении, то злоумышленник может найти страницы с измененными данными пользователя и добавить privilege=admin к отправленным HTTP-параметрам. При небезопасной настройке автопривязки серверный объект, представляющий пользователя, будет изменен соответствующим образом.

source: Two approaches can be used to handle this:
ru: Решить данную проблему можно двумя способами:

source: Avoid binding input directly and use Data Transfer Objects (DTOs) instead.
ru: избегать привязки входных данных напрямую и использовать вместо этого объекты переноса данных (DTO);

source: Enable auto-binding but set up whitelist rules for each page or feature to define which fields are allowed to be auto-bound.
ru: настроить белые списки для каждой страницы или функции, которые будут определять поля, разрешенные для автопривязки.

source: More examples are available in the OWASP Mass Assignment Cheat Sheet.
ru: Дополнительные примеры можно найти в Памятке OWASP по массовому назначению.

source: Validating and Sanitizing HTML
ru: Проверка и очистка HTML

source: Consider an application that needs to accept HTML from users (via a WYSIWYG editor that represents content as HTML or features that directly accept HTML in input). In this situation validation or escaping will not help.
ru: Рассмотрим приложение, которое будет принимать HTML от пользователей (через редактор WYSIWYG, представляющий содержимое как HTML, или через функции, напрямую принимающие HTML во входных данных). В этом случае проверка или очистка не поможет.

source: Regular expressions are not expressive enough to understand the complexity of HTML5.
ru: Регулярных выражений будет недостаточно, чтобы отобразить всю сложность HTML5.

source: Encoding or escaping HTML will not help since it will cause the HTML to not render properly.
ru: Кодировка или очистка HTML не подойдет, так как приведет к некорректному отображению HTML-кода.

source: Therefore, you need a library that can parse and clean HTML formatted text. Please see the XSS Prevention Cheat Sheet on HTML Sanitization for more information on HTML Sanitization.
ru: Таким образом, для обработки и преобразования (очистки) HTML-текста необходима специальная библиотека. Дополнительную информацию по очистке HTML см. в Памятке по предотвращению межсайтового выполнения сценариев в разделе Очистка HTML.

source: Validation Functionality in Libraries and Frameworks
ru: Функции проверки в библиотеках и фреймворках

source: All languages and most frameworks provide validation libraries or functions which should be leveraged to validate data. Validation libraries typically cover common data types, length requirements, integer ranges, "is null" checks and more. Many validation libraries and frameworks allow you to define your own regular expression or logic for custom validation in a way that allows the programmer to leverage that functionality throughout your application. Examples of validation functionality include PHP’s filter functions or the Hibernate Validator for Java. Examples of HTML Sanitizers include Ruby on Rails sanitize method, OWASP Java HTML Sanitizer or DOMPurify.
ru: Все языки и большинство фреймворков имеют библиотеки или функции, которые рекомендуется использовать для проверки данных. Подобные библиотеки, как правило, обеспечивают проверку стандартных типов данных, требований к длине, диапазонов целых чисел, "нулевых данных" и т. п. Большинство библиотек и фреймворков позволяют создавать собственные регулярные выражения или логику проверок, позволяя программистам использовать данную функцию в приложениях. Примеры реализации функции проверки: функции фильтрации PHP или Hibernate Validator для Java. Примеры инструментов для очистки HTML: метод очистки Ruby on Rails, средство очистки HTML на Java от OWASP или DOMPurify.

source: Vulnerabilities Prevented
ru: Предотвращаемые уязвимости

source: Input validation reduces the attack surface of applications and can sometimes make attacks more difficult against an application.
ru: Проверка входных данных снижает вероятность эксплуатации уязвимостей, а иногда затрудняет проведение атаки на приложение.

source: Input validation is a technique that provides security to certain forms of data, specific to certain attacks and cannot be reliably applied as a general security rule.
ru: Проверка входных данных обеспечивает защиту определенных видов данных от определенных видов атак, поэтому не может быть использована в качестве надежного средства обеспечения общей безопасности.

source: Input validation should not be used as the primary method of preventing XSS, SQL Injection and other attacks.
ru: Проверка входных данных не должна использоваться в качестве основного средства предотвращения Межсайтовых выполнений сценариев, Внедрений SQL-кода и прочих атак.

source: References
ru: Ссылки

source: OWASP Cheat Sheet: Input Validation
ru: Памятка OWASP: Проверка входных данных

source: OWASP Cheat Sheet: iOS - Security Decisions via Untrusted Inputs
ru: Памятка OWASP: iOS - Решения по безопасности с использованием непроверенных входных данных

source: OWASP Testing Guide: Testing for Input Validation
ru: Руководство OWASP по тестированию: Тестирование проверки входных данных

source: Tools
ru: Инструменты

source: OWASP Java HTML Sanitizer Project
ru: Средства очистки HTML на Java от OWASP

source: JEP-290 Filter Incoming Serialization Data
ru: JEP-290 фильтр входящих сериализованных данных

source: PHP’s filter functions
ru: Функции фильтрации PHP
