Repository: owasp-russia/top-10-proactive-controls
Catalog: source/locales/*/LC_MESSAGES/c6-implement-digital-identity.po
Languages: ru

source: Daniel Miessler: `Most commonly found passwords <https://github.com/danielmiessler/SecLists/tree/master/Passwords>`_
ru: Дэниел Мисслер (Daniel Miessler): Наиболее часто встречающиеся пароли <https://github.com/danielmiessler/SecLists/tree/master/Passwords>`_
