Repository: owasp-russia/top-10-proactive-controls
Catalog: source/locales/*/LC_MESSAGES/c6-implement-digital-identity.po
Languages: ru

source: C6: Implement Digital Identity
ru: C6: Внедрение цифровой идентификации

source: Description
ru: Описание

source: Digital Identity is the unique representation of a user (or other subject) as they engage in an online transaction. Authentication is the process of verifying that an individual or entity is who they claim to be. Session management is a process by which a server maintains the state of the users authentication so that the user may continue to use the system without re-authenticating. The `NIST Special Publication 800-63B: Digital Identity Guidelines (Authentication and Lifecycle Management <https://pages.nist.gov/800-63-3/sp800-63b.html>`_ provides solid guidance on implementing digital identity, authentication and session management controls.
ru: Цифровая идентификация — это уникальное представление пользователя (или любого другого объекта) при онлайн-транзакциях. Аутентификация — это процесс подтверждения того, что человек или сущность является тем, кем представляется. Управление сессиями — это процесс, с помощью которого сервер контролирует состояние аутентификации пользователя, чтобы он мог продолжать пользоваться системой без повторной аутентификации. `Специальное издание NIST 800-63B: Руководство по цифровой идентификации (Аутентификация и управление жизненным циклом) <https://pages.nist.gov/800-63-3/sp800-63b.html>`_ содержит подробные рекомендации по реализации требований к цифровым идентификаторам, аутентификации и управлению сессиями.

source: Below are some recommendations for secure implementation.
ru: Ниже приведены некоторые рекомендации по безопасной реализации.

source: Authentication Levels
ru: Уровни аутентификации

source: NIST 800-63b describes three levels of a authentication assurance called a authentication assurance level (AAL). AAL level 1 is reserved for lower-risk applications that do not contain PII or other private data. At AAL level 1 only single-factor authentication is required, typically through the use of a password.
ru: NIST 800-63b описывает три уровня обеспечения аутентификации (AAL). Уровень 1 зарезервирован для приложений пониженного риска, которые не содержат персональных или иных личных данных. Для первого уровня достаточно однофакторной аутентификации, обычно реализованной через использование пароля.

source: Level 1 : Passwords
ru: Уровень 1: Пароли

source: Passwords are really really important. We need policy, we need to store them securely, we need to sometimes allow users to reset them.
ru: Пароли на самом деле важны. К ним необходимо применять определенные политики, их хранение должно быть безопасным, в некоторых случаях у пользователя должна иметься возможность сброса пароля.

source: Password Requirements
ru: Требования к паролям

source: Passwords should comply with the following requirements at the very least:
ru: Пароли должны, как минимум, соответствовать следующим требованиям:

source: be at least 8 characters in length if multi-factor authentication (MFA) and other controls are also used. If MFA is not possible, this should be increased to at least 10 characters
ru: состоять из 8 символов, если используется многофакторная аутентификация (МФА) и другие методы контроля. Если использование МФА не представляется возможным, длину пароля необходимо увеличить, как минимум, до 10 символов;

source: all printing ASCII characters as well as the space character should be acceptable in memorized secrets
ru: все печатаемые символы ASCII, а также символ пробела, должны быть разрешены для использования в запоминаемых секретах;

source: encourage the use of long passwords and passphrases
ru: старайтесь использовать длинные пароли и кодовые фразы;

source: remove complexity requirements as these have been found to be of limited effectiveness. Instead, the adoption of MFA or longer password lengths is recommended
ru: откажитесь от требований к сложности пароля, поскольку их эффективность весьма ограниченна. Вместо этого рекомендуется использовать МФА или более длинные пароли;

source: ensure that passwords used are not commonly used passwords that have been already been leaked in a previous compromise. You may choose to block the top 1000 or 10000 most common passwords which meet the above length requirements and are found in compromised password lists. The following link contains the most commonly found passwords: `https://github.com/danielmiessler/SecLists/tree/master/Passwords <https://github.com/danielmiessler/SecLists/tree/master/Passwords>`_
ru: убедитесь в том, что используемые пароли не находятся в списке распространенных и ранее скомпрометированных паролей. Можно настроить блокировку паролей из топ-1000 или топ-10000 наиболее часто используемых паролей, которые соответствуют указанным выше требованиям к длине и присутствуют в списках скомпрометированных паролей. Самые распространенные пароли можно найти, перейдя по следующей ссылке: `https://github.com/danielmiessler/SecLists/tree/master/Passwords <https://github.com/danielmiessler/SecLists/tree/master/Passwords>`_

source: Implement Secure Password Recovery Mechanism
ru: Реализация механизма безопасного восстановления пароля

source: It is common for an application to have a mechanism for a user to gain access to their account in the event they forget their password. A good design workflow for a password recovery feature will use multi-factor authentication elements. For example, it may ask a security question - something they know, and then send a generated token to a device - something they own.
ru: Обычно приложения имеют механизм, позволяющий пользователям получить доступ к своей учетной записи, если они забыли пароль. При хорошей организации процесса разработки восстановления пароля используются элементы многофакторной аутентификации. Например, наличие контрольного вопроса, ответ на который известен пользователю, и отправка специально сгенерированного токена на устройство, которое принадлежит пользователю.

source: Please see the `Forgot_Password_Cheat_Sheet <https://www.owasp.org/index.php/Forgot_Password_Cheat_Sheet>`_ and `Choosing_and_Using_Security_Questions_Cheat_Sheet <https://www.owasp.org/index.php/Choosing_and_Using_Security_Questions_Cheat_Sheet>`_ for further details.
ru: Более подробную информацию см. в `Памятке по забытым паролям <https://www.owasp.org/index.php/Forgot_Password_Cheat_Sheet>`_ и `Памятке по выбору и использованию контрольных вопросов <https://www.owasp.org/index.php/Choosing_and_Using_Security_Questions_Cheat_Sheet>`_.

source: Implement Secure Password Storage
ru: Реализация безопасного хранения паролей

source: In order to provide strong authentication controls, an application must securely store user credentials. Furthermore, cryptographic controls should be in place such that if a credential (e.g., a password) is compromised, the attacker does not immediately have access to this information.
ru: Чтобы обеспечить надежность аутентификации, в приложении должно быть реализовано безопасное хранение учетных данных пользователей. Более того, необходимо наличие криптографической защиты, чтобы при компрометации учетных данных (например, паролей) злоумышленник не мог сразу же получить к ним доступ.

source: PHP Example for Password Storage
ru: Пример хранения паролей в PHP

source: Below is an example for secure password hashing in PHP using `password_hash()` function (available since 5.5.0) which defaults to using the bcrypt algorithm. The example uses a work factor of 15.
ru: Ниже приведен пример безопасного хеширования паролей в PHP с помощью функции password_hash() (доступна, начиная с версии 5.5.0), в которой по умолчанию используется алгоритм bcrypt. В примере используется фактор трудоемкости равный 15.

source: Please see the `OWASP Password Storage Cheat Sheet <https://www.owasp.org/index.php/Password_Storage_Cheat_Sheet>`_ for further details.
ru: Более подробную информацию см. в `Памятке OWASP по хранению паролей <https://www.owasp.org/index.php/Password_Storage_Cheat_Sheet>`_.

source: Level 2 : Multi-Factor Authentication
ru: Уровень 2: Многофакторная аутентификация (МФА)

source: NIST 800-63b AAL level 2 is reserved for higher-risk applications that contain "self-asserted PII or other personal information made available online." At AAL level 2 multi-factor authentication is required including OTP or other forms of multi-factor implementation.
ru: Уровень 2 (NIST 800-63b) зарезервирован для приложений повышенного риска, которые содержат "подтвержденные персональные или иные личные данные, доступные онлайн". На 2-м уровне AAL требуется многофакторная аутентификация, например, одноразовые пароли или другие формы МФА.

source: Multi-factor authentication (MFA) ensures that users are who they claim to be by requiring them to identify themselves with a combination of:
ru: Многофакторная аутентификация предполагает подтверждение того, что пользователь является тем, кем он себя называет, используя комбинацию из:

source: Something you know – password or PIN
ru: чего-то, известного пользователю — пароль или ПИН-код;

source: Something you own – token or phone
ru: чего-то, принадлежащего пользователю — токен или телефон;

source: Something you are – biometrics, such as a fingerprint
ru: чего-то, являющегося частью пользователя — биометрические данные, например, отпечаток пальца.

source: Using passwords as a sole factor provides weak security. Multi-factor solutions provide a more robust solution by requiring an attacker to acquire more than one element to authenticate with the service.
ru: Использование одного единственного фактора (пароля) обеспечивает слабую защиту. Многофакторные решения предоставляют более надежную защиту, поскольку атакующему требуется получение более одного компонента для аутентификации.

source: It is worth noting that biometrics, when employed as a single factor of authentication, are not considered acceptable secrets for digital authentication. They can be obtained online or by taking a picture of someone with a camera phone (e.g., facial images) with or without their knowledge, lifted from objects someone touches (e.g., latent fingerprints), or captured with high resolution images (e.g., iris patterns). Biometrics must be used only as part of multi-factor authentication with a physical authenticator (something you own). For example, accessing a multi-factor one-time password (OTP) device that will generate a one-time password that the user manually enters for the verifier.
ru: Стоит отметить, что биометрия, используемая в качестве единственного фактора аутентификации, считается неприемлемым решением для цифровой аутентификации. Биометрические данные могут быть получены через интернет или путем съемки человека на камеру телефона (например, для получения изображения лица) с его согласия или тайно; также биоданные могут быть сняты с объектов, к которым прикасался человек (например, для получения отпечатков пальцев); кроме того, данные могут быть получены с использованием снимков высокого разрешения (например, для получения узора радужной оболочки глаза). Биометрия должна использоваться только в составе многофакторной аутентификации с применением физического средства аутентификации (чего-то, принадлежащего человеку). Например, использование устройства для генерирования одноразовых паролей, вводимых пользователем вручную в устройство контроля.

source: Level 3 : Cryptographic Based Authentication
ru: Уровень 3: Аутентификация на основе шифрования

source: NIST 800-63b Authentication Assurance Level 3 (AAL3) is required when the impact of compromised systems could lead to personal harm, significant financial loss, harm the public interest or involve civil or criminal violations. AAL3 requires authentication that is "based on proof of possession of a key through a cryptographic protocol." This type of authentication is used to achieve the strongest level of authentication assurance. This is typically done though hardware cryptographic modules.
ru: Уровень 3 (NIST 800-63b) используется, если вред от компрометации системы может нанести личный ущерб или ущерб государственным интересам, а также привести к значительным финансовым потерям и гражданским или уголовным правонарушениям. Для 3-го уровня требуется аутентификация, "основанная на подтверждении обладания ключом через протокол шифрования". Данный тип используется для обеспечения наивысшего уровня надежности аутентификации и, как правило, реализуется через аппаратные модули шифрования.

source: Session Management
ru: Управление сессиями

source: Once the initial successful user authentication has taken place, an application may choose to track and maintain this authentication state for a limited amount of time. This will allow the user to continue using the application without having to keep re-authentication with each request. Tracking of this user state is called Session Management.
ru: После успешной аутентификации пользователя приложение может отслеживать и сохранять его аутентифицированное состояние некоторое время. Это позволяет пользователю продолжать работу с приложением без повторной аутентификации при каждом последующем запросе. Контроль такого состояния называется Управление сессиями.

source: Session Generation and Expiration
ru: Создание и завершение сессий

source: User state is tracked in a session. This session is typically stored on the server for traditional web based session management. A session identifier is then given to the user so the user can identify which server-side session contains the correct user data. The client only needs to maintain this session identifier, which also keeps sensitive server-side session data off of the client.
ru: Состояние пользователя контролируется через сессии. При стандартном управлении веб-сессиями они, как правило, хранятся на сервере. Пользователю предоставляется идентификатор сессии, по которому он может определить, какая сессия на стороне сервера содержит корректные данные о пользователе. Клиенту требуется только идентификатор сессии, важные серверные данные о сессии клиенту не предоставляются.

source: Here are a few controls to consider when building or implementing session management solutions:
ru: Вот несколько требований, которые следует учесть при создании или реализации механизма управления сессиями:

source: Ensure that the session id is long, unique and random.
ru: идентификатор сессии должен быть длинным, уникальным и случайным;

source: The application should generate a new session or at least rotate the session id during authentication and re-authentication.
ru: приложение должно создавать новую сессию или, как минимум, менять идентификатор сессии при первичной и повторной аутентификации;

source: The application should implement an idle timeout after a period of inactivity and an absolute maximum lifetime for each session, after which users must re-authenticate. The length of the timeouts should be inversely proportional with the value of the data protected.
ru: для каждой сессии должно быть установлено время простоя (бездействия) и время существования, после которого пользователи должны повторно проходить процедуру аутентификации. Время ожидания должно быть обратно пропорционально важности защищаемых данных.

source: Please see the `Session Management Cheat Sheet <https://www.owasp.org/index.php/Session_Management_Cheat_Sheet>`_ further details. ASVS Section 3 covers additional session management requirements.
ru: Более подробную информацию см. в `Памятке по управлению сессиями <https://www.owasp.org/index.php/Session_Management_Cheat_Sheet>`_. Дополнительные требования к управлению сессиями содержатся в разделе 3 стандарта ASVS.

source: Browser Cookies
ru: Куки-файлы браузеров

source: Browser cookies are a common method for web application to store session identifiers for web applications implementing standard session management techniques. Here are some defenses to consider when using browser cookies.
ru: Куки-файлы используются для хранения идентификаторов сессий в веб-приложениях со стандартной схемой управления сессиями. Вот несколько советов по обеспечению безопасности при использовании куки-файлов:

source: When browser cookies are used as the mechanism for tracking the session of an authenticated user, these should be accessible to a minimum set of domains and paths and should be tagged to expire at, or soon after, the session's validity period.
ru: когда куки-файлы используются для контроля сессий аутентифицированных пользователей, доступ к ним должен ограничиваться минимальным набором доменов и путей, а также они должны становиться недействительными сразу или вскоре после окончания срока действия сессии;

source: The 'secure' flag should be set to ensure the transfer is done via secure channel only (TLS).
ru: должен быть установлен флаг secure, обеспечивающий передачу данных только по безопасному каналу (TLS);

source: HttpOnly flag should be set to prevent the cookie from being accessed via JavaScript.
ru: должен быть установлен флаг HttpOnly, предотвращающий доступ к куки-файлам с помощью JavaScript;

source: Adding "`samesite <https://www.owasp.org/index.php/SameSite>`_" attributes to cookies prevents some `modern browsers <https://caniuse.com/#search=samesite>`_ from sending cookies with cross-site requests and provides protection against cross-site request forgery and information leakage attacks.
ru: добавление атрибутов "`samesite <https://www.owasp.org/index.php/SameSite>`_" к куки-файлам предотвращает отправку некоторыми `современными браузерами <https://caniuse.com/#search=samesite>`_ куки-файлов с межсайтовыми запросами, а также обеспечивает защиту от межсайтовой подмены запросов и утечки данных.

source: Tokens
ru: Токены

source: Server-side sessions can be limiting for some forms of authentication. "Stateless services" allow for client side management of session data for performance purposes so they server has less of a burden to store and verify user session. These "stateless" applications generate a short-lived access token which can be used to authenticate a client request without sending the user's credentials after the initial authentication.
ru: Сессии на стороне сервера могут быть ограничены для некоторых форм аутентификации. "Службы без сохранения состояния" позволяют управлять данными сессий на стороне клиента, чтобы повысить производительность, а также снизить нагрузку на сервер в части хранения и контроля сессий. Подобные приложения, "без сохранения состояния", создают кратковременные токены доступа, которые используются после прохождения пользователем аутентификации для проверки клиентских запросов (без отправки учетных данных).

source: JWT (JSON Web Tokens)
ru: JWT (веб-токены JSON)

source: JSON Web Token (JWT) is an open standard (`RFC 7519 <https://tools.ietf.org/html/rfc7519>`_) that defines a compact and self-contained way for securely transmitting information between parties as a JSON object. This information can be verified and trusted because it is digitally signed. A JWT token is created during authentication and is verified by the server (or servers) before any processing.
ru: Веб-токены JSON (JWT) представляют открытый стандарт (`RFC 7519 <https://tools.ietf.org/html/rfc7519>`_) компактного и самодостаточного способа безопасной передачи данных между участниками с помощью JSON-объектов. Эти данные могут быть проверены и подтверждены, поскольку имеют цифровую подпись. JWT-токены создаются во время аутентификации и проверяются сервером (или серверами) перед началом обработки данных.

source: However, JWT's are often not saved by the server after initial creation. JWT's are typically created and then handed to a client without being saved by the server in any way. The integrity of the token is maintained through the use of digital signatures so a server can later verify that the JWT is still valid and was not tampered with since its creation.
ru: После создания токены JWT, как правило, не сохраняются на сервере, а передаются клиенту. Целостность токена контролируется цифровой подписью, которая позволяет впоследствии проверить действительность и отсутствие модификаций JWT-токена.

source: This approach is both stateless and portable in the way that client and server technologies can be different yet still interact.
ru: Подобный подход не требует сохранения состояния и обеспечивает автономность, поэтому отличия в технологиях клиента и сервера не мешают их взаимодействию.

source: Caution
ru: Внимание!

source: Digital identity, authentication and session management are very big topics. We're scratching the surface of the topic of Digital Identity here. Ensure that your most capable engineering talent is responsible for maintaining the complexity involved with most Identity solutions.
ru: Цифровая идентификация, аутентификация и управление сессиями — это сложные и обширные темы. Здесь мы рассматриваем лишь вершину айсберга цифровой идентификации. Убедитесь, что реализацией решений, связанных с идентификацией, занимается ваш самый способный и ответственный инженер.

source: Vulnerabilities Prevented
ru: Предотвращаемые уязвимости

source: `OWASP Top 10 2017 A2- Broken Authentication and Session Management <https://www.owasp.org/index.php/Top_10-2017_A2-Broken_Authentication>`_
ru: `Топ-10 OWASP 2017 - A2: Недостатки аутентификации и управления сессиями <https://www.owasp.org/index.php/Top_10-2017_A2-Broken_Authentication>`_

source: `OWASP Mobile Top 10 2014-M5- Poor Authorization and Authentication <https://www.owasp.org/index.php/Mobile_Top_10_2014-M5>`_
ru: `Топ-10 OWASP 2014 (мобильные устройства) - M5: Ненадежная авторизация и аутентификация <https://www.owasp.org/index.php/Mobile_Top_10_2014-M5>`_

source: References
ru: Ссылки

source: `OWASP Cheat Sheet: Authentication <https://www.owasp.org/index.php/Authentication_Cheat_Sheet>`_
ru: `Памятка OWASP: Аутентификация <https://www.owasp.org/index.php/Authentication_Cheat_Sheet>`_

source: `OWASP Cheat Sheet: Password Storage <https://www.owasp.org/index.php/Password_Storage_Cheat_Sheet>`_
ru: `Памятка OWASP: Хранение паролей <https://www.owasp.org/index.php/Password_Storage_Cheat_Sheet>`_

source: `OWASP Cheat Sheet: Forgot Password <https://www.owasp.org/index.php/Password_Storage_Cheat_Sheet>`_
ru: `Памятка OWASP: Забытый пароль <https://www.owasp.org/index.php/Password_Storage_Cheat_Sheet>`_

source: `OWASP Cheat Sheet: Choosing and Using Security Questions <https://www.owasp.org/index.php/Choosing_and_Using_Security_Questions_Cheat_Sheet>`_
ru: `Памятка OWASP: Выбор и использование контрольных вопросов <https://www.owasp.org/index.php/Choosing_and_Using_Security_Questions_Cheat_Sheet>`_

source: `OWASP Cheat Sheet: Session Management <https://www.owasp.org/index.php/Session_Management_Cheat_Sheet>`_
ru: `Памятка OWASP: Управление сессиями <https://www.owasp.org/index.php/Session_Management_Cheat_Sheet>`_

source: `OWASP Cheat Sheet: IOS Developer <https://www.owasp.org/index.php/IOS_Developer_Cheat_Sheet>`_
ru: `Памятка OWASP: Для разработчиков iOS <https://www.owasp.org/index.php/IOS_Developer_Cheat_Sheet>`_

source: `OWASP Testing Guide: Testing for Authentication <https://www.owasp.org/index.php/Testing_for_authentication>`_
ru: `Руководство OWASP по тестированию: Тестирование аутентификации <https://www.owasp.org/index.php/Testing_for_authentication>`_

source: `NIST Special Publication 800-63 Revision 3 - Digital Identity Guidelines <https://pages.nist.gov/800-63-3/sp800-63-3.html>`_
ru: `Специальное издание NIST 800-63 (Редакция 3) - Руководство по цифровой идентификации <https://pages.nist.gov/800-63-3/sp800-63-3.html>`_

source: Tools
ru: Инструменты
