Repository: owasp-russia/top-10-proactive-controls
Catalog: source/locales/*/LC_MESSAGES/c7-enforce-access-controls.po
Languages: ru

source: C7: Enforce Access Controls
ru: C7: Обязательный контроль доступа

source: Description
ru: Описание

source: Access Control (or Authorization) is the process of granting or denying specific requests from a user, program, or process. Access control also involves the act of granting and revoking those privileges.
ru: Контроль доступа (или Авторизация) заключается в разрешении или запрещении специфических запросов, поступающих от пользователей, программ или процессов, а также предполагает выдачу и отзыв подобных привилегий.

source: It should be noted that authorization (verifying access to specific features or resources) is not equivalent to authentication (verifying identity).
ru: Необходимо отметить, что авторизация (подтверждение права доступа к специальным функциям или ресурсам) не равняется аутентификации (подтверждению личности).

source: Access Control functionality often spans many areas of software depending on the complexity of the access control system. For example, managing access control metadata or building caching for scalability purposes are often additional components in an access control system that need to be built or managed. There are several different types of access control design that should be considered.
ru: Контроль доступа обычно затрагивает большинство разделов ПО, в зависимости от сложности системы контроля доступа. Например, управление метаданными контроля доступа или кэширование для целей масштабируемости обычно являются дополнительными компонентами системы контроля доступа, которые необходимо создавать или обслуживать. Существует несколько разных подходов к контролю доступа:

source: Discretionary Access Control (DAC) is a means of restricting access to objects (e.g., files, data entities) based on the identity and need-to-know of subjects (e.g., users, processes) and/or groups to which the object belongs.
ru: избирательное управление доступом (DAC) — предполагает ограничение доступа к объектам (например, файлам или элементам данных) на основе идентификатора, а также принципа "необходимого знания" субъектов (например, пользователей или процессов) и/или групп, которым принадлежат объекты;

source: Mandatory Access Control (MAC) is a means of restricting access to system resources based on the sensitivity (as represented by a label) of the information contained in the system resource and the formal authorization (i.e., clearance) of users to access information of such sensitivity.
ru: мандатное управление доступом (MAC) — предполагает ограничение доступа к системным ресурсам на основе важности (определяемой метками) данных, содержащихся в этих ресурсах, и формальных полномочий (т. е. допуска) пользователей на доступ к информации, указанной важности;

source: Role Based Access Control (RBAC) is a model for controlling access to resources where permitted actions on resources are identified with roles rather than with individual subject identities.
ru: ролевая модель управления доступом (RBAC) — предполагает контроль доступа к ресурсам на основе ролей, определяющих разрешенные действия с ресурсами, а не на основе идентификаторов субъектов;

source: Attribute Based Access Control (ABAC) will grant or deny user requests based on arbitrary attributes of the user and arbitrary attributes of the object, and environment conditions that may be globally recognized and more relevant to the policies at hand.
ru: управление доступом на основе атрибутов (ABAC) — предполагает разрешение или запрещение запросов пользователя, исходя из атрибутов пользователя и атрибутов объекта, а также элементов окружения, которые могут определяться глобально и быть более релевантными для применяемых политик.

source: Access Control Design Principles
ru: Принципы создания систем контроля доступа

source: The following "positive" access control design requirements should be considered at the initial stages of application development.
ru: Следующие требования к проектированию систем контроля доступа необходимо учитывать на начальных стадиях разработки приложения.

source: 1) Design Access Control Thoroughly Up Front
ru: 1) Проектируйте тщательно и заранее

source: Once you have chosen a specific access control design pattern, it is often difficult and time consuming to re-engineer access control in your application with a new pattern. Access Control is one of the main areas of application security design that must be thoroughly designed up front, especially when addressing requirements like multi-tenancy and horizontal (data dependent) access control.
ru: После выбора модели контроля доступа процесс переработки приложения в соответствии с новым шаблоном обычно отнимает много сил и времени. Контроль доступа является одним из основных аспектов обеспечения безопасности приложения, который необходимо тщательно и заранее проработать, особенно при реализации требований мультитенантности и горизонтального (зависящего от данных) контроля доступа.

source: Access Control design may start simple but can often grow into a complex and feature-heavy security control. When evaluating access control capability of software frameworks, ensure that your access control functionality will allow for customization for your specific access control feature need.
ru: Проект контроля доступа может начинаться просто, но зачастую превращается в сложную и многофункциональную систему контроля безопасности. При оценке возможностей фреймворков в части контроля доступа убедитесь в том, что они позволят вам адаптировать контроль доступа под свои нужды.

source: 2) Force All Requests to Go Through Access Control Checks
ru: 2) Направляйте все запросы через систему контроля доступа

source: Ensure that all request go through some kind of access control verification layer. Technologies like Java filters or other automatic request processing mechanisms are ideal programming artifacts that will help ensure that all requests go through some kind of access control check.
ru: Убедитесь, что все запросы проходят проверку прав доступа. Технологии, такие как Java-фильтры или другие механизмы автоматической обработки запросов, являются идеальными программными артефактами, помогающими обеспечить проверку контроля доступа всех запросов.

source: 3) Deny by Default
ru: 3) Запрещайте доступ по умолчанию

source: Deny by default is the principle that if a request is not specifically allowed, it is denied. There are many ways that this rule will manifest in application code. Some examples of these are:
ru: Запрет по умолчанию означает, что если запрос не разрешен специально, то он отклоняется. Есть много способов реализации данного правила в коде приложения. Ниже представлены некоторые из них.

source: Application code may throw an error or exception while processing access control requests. In these cases access control should always be denied.
ru: Приложение может выдавать ошибку или исключение при обработке запросов на предоставление доступа. В подобных случаях в доступе должно быть отказано.

source: When an administrator creates a new user or a user registers for a new account, that account should have minimal or no access by default until that access is configured.
ru: При создании администратором или пользователем новой учетной записи эта учетная запись по умолчанию должна иметь минимальный или нулевой набор прав доступа, пока эти права не будут назначены.

source: When a new feature is added to an application all users should be denied to use that feature until it's properly configured.
ru: При добавлении новой функции в приложение никто из пользователей не должен иметь права использовать ее до выполнения соответствующей настройки.

source: 4) Principle of Least Privilege
ru: 4) Принцип минимальных привилегий

source: Ensure that all users, programs, or processes are only given as least or as little necessary access as possible. Be wary of systems that do not provide granular access control configuration capabilities.
ru: Убедитесь, что все пользователи, программы или процессы имеют минимальные или только необходимые права доступа. Внимание: некоторые системы не поддерживают настройку детального управления доступом.

source: 5) Don't Hardcode Roles
ru: 5) Не используйте жестко закодированные роли

source: Many application frameworks default to access control that is role based. It is common to find application code that is filled with checks of this nature.
ru: Многие средства создания приложений по умолчанию используют ролевую модель управления доступом. В коде многих приложений не редко встречаются проверки подобного рода.

source: Be careful about this type of role-based programming in code. It has the following limitations or dangers.
ru: Нужно быть осторожным при использовании ролевой модели в коде. Она имеет следующие ограничения и риски.

source: Role based programming of this nature is fragile. It is easy to create incorrect or missing role checks in code.
ru: Программирование с использованием ролевой модели — дело рискованное. Легко создать некорректную или пропустить проверку ролей в коде.

source: Role based programming does not allow for multi-tenancy. Extreme measures like forking the code or added checks for each customer will be required to allow role based systems to have different rules for different customers.
ru: Программирование с использованием ролевой модели не поддерживает мультитенантность. Использование ролевой модели в системах разных заказчиков потребует создания отдельной ветки кода или добавления отдельных проверок для каждого заказчика.

source: Role based programming does not allow for data-specific or horizontal access control rules.
ru: Программирование с использованием ролевой модели не поддерживает зависящее от данных или горизонтальное управление доступом.

source: Large codebases with many access control checks can be difficult to audit or verify the overall application access control policy.
ru: Для больших баз кода с множеством проверок прав доступа бывает сложно проводить аудит или проверять политику управления доступом во всем приложении.

source: Instead, please consider the following access control programming methodology:
ru: Вместо этого попробуйте использовать следующий способ управления доступом:

source: Attribute or feature-based access control checks of this nature are the starting point to building well-designed and feature-rich access control systems. This type of programming also allows for greater access control customization capability over time.
ru: Подобные проверки прав доступа на основе атрибутов или компонентов могут служить отправной точкой для создания хорошо спроектированной и многофункциональной системы управления доступом. Подобный тип программирования в дальнейшем обеспечит более гибкую кастомизацию контроля доступа.

source: 6) Log All Access Control Events
ru: 6) Регистрируйте все события, связанные с контролем доступа

source: All access control failures should be logged as these may be indicative of a malicious user probing the application for vulnerabilities.
ru: Все неудачные попытки получения доступа должны регистрироваться, поскольку они могут служить признаком поиска злоумышленником уязвимостей в приложении.

source: Vulnerabilities Prevented
ru: Предотвращаемые уязвимости

source: OWASP Top 10 2017-A5-Broken Access Control
ru: Топ-10 OWASP 2017 - А5: Недостатки контроля доступа

source: OWASP Mobile Top 10 2014-M5 Poor Authorization and Authentication
ru: Топ-10 OWASP 2014 (мобильные устройства) - M5: Ненадежная авторизация и аутентификация

source: References
ru: Ссылки

source: OWASP Cheat Sheet: Access Control
ru: Памятка OWASP: Контроль доступа

source: OWASP Cheat Sheet: iOS Developer - Poor Authorization and Authentication
ru: Памятка OWASP: Для разработчиков iOS - Ненадежная авторизация и аутентификация

source: OWASP Testing Guide: Testing for Authorization
ru: Руководство OWASP по тестированию: Тестирование авторизации

source: Tools
ru: Инструменты

source: OWASP ZAP with the optional Access Control Testing add-on
ru: OWASP ZAP с дополнительным компонентом для Тестирования контроля доступа
