Repository: owasp-russia/top-10-proactive-controls
Catalog: source/locales/*/LC_MESSAGES/c8-protect-data-everywhere.po
Languages: ru

source: C8: Protect Data Everywhere
ru: C8: Повсеместная защита данных

source: Description
ru: Описание

source: Sensitive data such as passwords, credit card numbers, health records, personal information and business secrets require extra protection, particularly if that data falls under privacy laws (EU's General Data Protection Regulation GDPR), financial data protection rules such as PCI Data Security Standard (PCI DSS) or other regulations
ru: Конфиденциальные данные, такие как пароли, номера кредитных карт, медицинские записи, персональные данные и коммерческие тайны требуют дополнительной защиты, особенно если они подпадают под действие закона о неприкосновенности данных, например, Общего регламента ЕС по защите данных (GDPR), или закона о защите финансовых данных, например, Стандарта безопасности данных в сфере платежных карт (PCI DSS).

source: Attackers can steal data from web and webservice applications in a number of ways. For example, if sensitive information in sent over the internet without communications security, then an attacker on a shared wireless connection could see and steal another user's data. Also, an attacker could use SQL Injection to steal passwords and other credentials from an applications database and expose that information to the public.
ru: Злоумышленники могут похитить данные из веб-приложений и веб-служб множеством разных способов. Например, атакующий может подключиться к общей беспроводной сети и просмотреть или похитить конфиденциальные данные других пользователей, если они передаются через небезопасное интернет-подключение. Также злоумышленник может использовать внедрение SQL-кода, чтобы похитить пароли и другие учетные данные из приложений, а затем выложить их в открытый доступ.

source: Data Classification
ru: Классификация данных

source: It's critical to classify data in your system and determine which level of sensitivity each piece of data belongs to. Each data category can then be mapped to protection rules necessary for each level of sensitivity. For example, public marketing information that is not sensitive may be categorized as public data which is ok to place on the public website. Credit card numbers may be classified as private user data which may need to be encrypted while stored or in transit.
ru: Необходимо классифицировать данные в вашей системе и определить к какому уровню критичности относится каждый блок данных. Каждая категория данных затем может быть соотнесена с правилами защиты, определяемыми для каждого уровня критичности. Например, публичная маркетинговая информация, не являющаяся конфиденциальной, может быть отнесена к общедоступным данным, которые можно размещать на общедоступном сайте. Номера кредитных карт можно отнести к персональным данным пользователей, которые требуют шифрования при их хранении или передаче.

source: Encrypting Data in Transit
ru: Шифрование передаваемых данных

source: When transmitting sensitive data over any network, end-to-end communications security (or encryption-in-transit) of some kind should be considered. TLS is by far the most common and widely supported cryptographic protocol for communications security. It is used by many types of applications (web, webservice, mobile) to communicate over a network in a secure fashion. TLS must be properly configured in a variety of ways in order to properly defend secure communications.
ru: При передаче конфиденциальных данных через любую сеть необходимо применять сквозную защиту соединений (или шифрование). TLS, безоговорочно, является самым распространенным и поддерживаемым криптографическим протоколом, обеспечивающим безопасность соединений. Он используется во многих сферах (веб-приложения, веб-службы, мобильные приложения) для безопасной передачи данных по сети. Для обеспечения безопасности соединений TLS необходимо правильно настроить.

source: The primary benefit of transport layer security is the protection of web application data from unauthorized disclosure and modification when it is transmitted between clients (web browsers) and the web application server, and between the web application server and back end and other non-browser based enterprise components.
ru: Основная польза от протокола TLS — это защита данных веб-приложений от несанкционированного доступа и изменений при их передаче между клиентами (веб-браузерами) и сервером веб-приложения, а также между сервером веб-приложения и внутренним сервером или другими, не относящимися к браузеру, компонентами организации.

source: Encrypting Data at Rest
ru: Шифрование хранимых данных

source: The first rule of sensitive data management is to avoid storing sensitive data when at all possible. If you must store sensitive data then make sure it's cryptographically protected in some way to avoid unauthorized disclosure and modification.
ru: Первое правило управления конфиденциальными данными — избегать хранения конфиденциальных данных, когда это возможно. Если сохранять конфиденциальные данные необходимо, то убедитесь в наличии у них криптографической защиты от несанкционированного доступа и изменений.

source: Cryptography (or crypto) is one of the more advanced topics of information security, and one whose understanding requires the most schooling and experience. It is difficult to get right because there are many approaches to encryption, each with advantages and disadvantages that need to be thoroughly understood by web solution architects and developers. In addition, serious cryptography research is typically based in advanced mathematics and number theory, providing a serious barrier to entry.
ru: Криптография является одной из самых передовых областей информационной безопасности, ее понимание требует обширных знаний и опыта. Трудно выбрать какое-то одно единственное решение, поскольку существует множество разных подходов к шифрованию, каждый из которых имеет свои преимущества и недостатки, которые веб-архитекторы и веб-разработчики должны четко понимать. Более того, серьезное криптографическое исследование обычно основывается на высшей математике и теории чисел, что создает высокий входной порог.

source: Instead of building cryptographic capability from scratch, it is strongly recommended that peer reviewed and open solutions be used, such as the `Google Tink <https://github.com/google/tink>`_ project, `Libsodium <https://www.libsodium.org>`_, and secure storage capability built into many software frameworks and cloud services.
ru: Вместо создания новых алгоритмов шифрования с нуля, настойчиво рекомендуем использовать решения с открытым исходным кодом, которые прошли независимую экспертизу, например, `Google Tink <https://github.com/google/tink>`_ project, `Libsodium <https://www.libsodium.org>`_ или `Libsodium <https://www.libsodium.org>`_, а также возможности безопасного хранения, встроенные во многие средства разработки ПО и облачные сервисы.

source: Mobile Application: Secure Local Storage
ru: Мобильные приложения: Безопасное локальное хранение данных

source: Mobile applications are at particular risk of data leakage because mobile devices are regularly lost or stolen yet contain sensitive data.
ru: Мобильные приложения представляют особую группу риска утечки данных, поскольку мобильные устройства регулярно теряются и воруются, но при этом содержат конфиденциальные данные.

source: As a general rule, only the minimum data required should be stored on the mobile device. But if you must store sensitive data on a mobile device, then sensitive data should be stored within each mobile operating systems specific data storage directory. On Android this will be the Android keystore and on iOS this will be the iOS keychain.
ru: На мобильных устройствах необходимо хранить минимум данных. Но если вам необходимо хранить конфиденциальные данные на мобильном устройстве, то эти данные должны храниться в специальном каталоге, в каждой мобильной ОС он свой. В Андроиде это будет хранилище ключей Android, а в iOS — связка ключей iOS.

source: Key Lifecycle
ru: Жизненный цикл ключей

source: Secret keys are used in applications number of sensitive functions. For example, secret keys can be used to to sign JWTs, protect credit cards, provide various forms of authentication as well as facilitation other sensitive security features. In managing keys, a number of rules should be followed including:
ru: Секретные ключи используются в приложениях для нескольких целей. Например, секретные ключи могут использоваться для подписи токенов JWT, защиты кредитных карт, различных форм аутентификации, а также для других функций обеспечения безопасности критичных данных. При управлении ключами придерживайтесь следующих правил:

source: Ensure that any secret key is protected from unauthorized access
ru: обеспечьте защиту секретных ключей от несанкционированного доступа;

source: Store keys in a proper secrets vault as described below
ru: храните ключи в соответствующем хранилище, как это описано ниже;

source: Use independent keys when multiple keys are required
ru: используйте независимые ключи, когда требуются несколько ключей;

source: Build support for changing algorithms and keys when needed
ru: реализуйте возможность замены алгоритмов и ключей, при необходимости;

source: Build application features to handle a key rotation
ru: реализуйте в приложении механизм смены ключей.

source: Application Secrets Management
ru: Управление секретами в приложении

source: Applications contain numerous "secrets" that are needed for security operations. These include certificates, SQL connection passwords, third party service account credentials, passwords, SSH keys, encryption keys and more. The unauthorized disclosure or modification of these secrets could lead to complete system compromise. In managing application secrets, consider the following.
ru: Приложения содержат огромное количество "секретов", необходимых для выполнения проверок безопасности, например, сертификаты, пароли SQL-соединений, учетные данные сторонних служб, пароли, SSH-ключи и ключи шифрования. Несанкционированное разглашение или изменение этих секретов может привести к полной компрометации системы. При управлении секретами в приложениях придерживайтесь следующих правил:

source: Don't store secrets in code, config files or pass them through environment variables. Use tools like `GitRob <https://github.com/michenriksen/gitrob>`_ or `TruffleHog <https://github.com/dxa4481/truffleHog>`_ to scan code repos for secrets.
ru: не храните секретные ключи в коде, файлах конфигурации, а также не передавайте их через переменные окружения. Используйте `GitRob <https://github.com/michenriksen/gitrob>`_ или `TruffleHog <https://github.com/dxa4481/truffleHog>`_ для поиска секретов в репозиториях;

source: Keep keys and your other application-level secrets in a secrets vault like `KeyWhiz <https://github.com/square/keywhiz>`_ or Hashicorp's `Vault project <https://www.vaultproject.io/>`_ or `Amazon KMS <https://aws.amazon.com/kms/>`_ to provide secure storage and access to application-level secrets at run-time.
ru: используйте для ключей и прочих секретов уровня приложения специальные хранилища, например, `KeyWhiz <https://github.com/square/keywhiz>`_ , проект `Vault <https://www.vaultproject.io/>`_ от компании Hashicorp или `Amazon KMS <https://aws.amazon.com/kms/>`_, обеспечивающие безопасность хранения и доступа к секретным ключам во время работы приложения.

source: Vulnerabilities Prevented
ru: Предотвращаемые уязвимости

source: `OWASP Top 10 2017 - A3: Sensitive Data Exposure <https://www.owasp.org/index.php/Top_10-2017_A3-Sensitive_Data_Exposure>`_
ru: `Топ-10 OWASP 2017 - А3: Разглашение критичных данных <https://www.owasp.org/index.php/Top_10-2017_A3-Sensitive_Data_Exposure>`_

source: `OWASP Mobile Top 10 2014-M2 Insecure Data Storage <https://www.owasp.org/index.php/Mobile_Top_10_2014-M2>`_
ru: `Топ-10 OWASP 2014 (мобильные устройства) - M2: Небезопасное хранение данных <https://www.owasp.org/index.php/Mobile_Top_10_2014-M2>`_

source: References
ru: Ссылки

source: `OWASP Cheat Sheet: Transport Layer Protection <https://www.owasp.org/index.php/Transport_Layer_Protection_Cheat_Sheet>`_
ru: `Памятка OWASP: Защита транспортного уровня <https://www.owasp.org/index.php/Transport_Layer_Protection_Cheat_Sheet>`_

source: `Ivan Ristic: SSL/TLS Deployment Best Practices <https://www.ssllabs.com/projects/best-practices/index.html>`_
ru: `Ivan Ristic: Рекомендации по внедрению SSL/TLS <https://www.ssllabs.com/projects/best-practices/index.html>`_

source: `OWASP Cheat Sheet: HSTS <https://www.owasp.org/index.php/HTTP_Strict_Transport_Security_Cheat_Sheet>`_
ru: `Памятка OWASP: Принудительное использование HTTPS (HSTS) <https://www.owasp.org/index.php/HTTP_Strict_Transport_Security_Cheat_Sheet>`_

source: `OWASP Cheat Sheet: Cryptographic Storage <https://www.owasp.org/index.php/Cryptographic_Storage_Cheat_Sheet>`_
ru: `Памятка OWASP: Хранение в зашифрованном виде <https://www.owasp.org/index.php/Cryptographic_Storage_Cheat_Sheet>`_

source: `OWASP Cheat Sheet: Password Storage <https://www.owasp.org/index.php/Password_Storage_Cheat_Sheet>`_
ru: `Памятка OWASP: Хранение паролей <https://www.owasp.org/index.php/Password_Storage_Cheat_Sheet>`_

source: `OWASP Cheat Sheet: IOS Developer - Insecure Data Storage <https://www.owasp.org/index.php/IOS_Developer_Cheat_Sheet#Insecure_Data_Storage_.28M1.29>`_
ru: `Памятка OWASP: Для разработчиков iOS - Небезопасное хранение данных <https://www.owasp.org/index.php/IOS_Developer_Cheat_Sheet#Insecure_Data_Storage_.28M1.29>`_

source: `OWASP Testing Guide: Testing for TLS <https://www.owasp.org/index.php/Testing_for_Weak_SSL/TLS_Ciphers,_Insufficient_Transport_Layer_Protection_(OTG-CRYPST-001)>`_
ru: `Руководство OWASP по тестированию: Тестирование TLS <https://www.owasp.org/index.php/Testing_for_Weak_SSL/TLS_Ciphers,_Insufficient_Transport_Layer_Protection_(OTG-CRYPST-001)>`_

source: Tools
ru: Инструменты

source: `SSLyze <https://github.com/nabla-c0d3/sslyze>`_ - SSL configuration scanning library and CLI tool
ru: `SSLyze <https://github.com/nabla-c0d3/sslyze>`_ — инструмент командной строки и библиотека для сканирования конфигураций SSL

source: `SSLLabs <https://www.ssllabs.com/ssltest/>`_ - Free service for scanning and checking TLS/SSL configuration
ru: `SSLLabs <https://www.ssllabs.com/ssltest/>`_ — бесплатная служба для сканирования и проверки конфигураций TLS/SSL

source: `OWASP O-Saft TLS Tool <https://www.owasp.org/index.php/O-Saft>`_ - TLS connection testing tool
ru: `OWASP O-Saft TLS Tool <https://www.owasp.org/index.php/O-Saft>`_ — инструмент для тестирования TLS-соединений

source: `GitRob <https://github.com/michenriksen/gitrob>`_ - Command line tool to find sensitive information in publicly available files on GitHub
ru: `GitRob <https://github.com/michenriksen/gitrob>`_ — инструмент командной строки для поиска критичных данных в общедоступных файлах на GitHub

source: `TruffleHog <https://github.com/dxa4481/truffleHog>`_ - Searches for secrets accidentally committed
ru: `TruffleHog <https://github.com/dxa4481/truffleHog>`_ — инструмент для поиска случайно закоммиченных секретов

source: `KeyWhiz <https://github.com/square/keywhiz>`_ - Secrets manager
ru: `KeyWhiz <https://github.com/square/keywhiz>`_ — менеджер секретов

source: `Hashicorp Vault <https://www.vaultproject.io/>`_ - Secrets manager
ru: `Hashicorp Vault <https://www.vaultproject.io/>`_ — менеджер секретов

source: `Amazon KMS <https://aws.amazon.com/kms/>`_ - Manage keys on Amazon AWS
ru: `Amazon KMS <https://aws.amazon.com/kms/>`_ — инструмент управления ключами на Amazon AWS
