Repository: owasp-russia/top-10-proactive-controls
Catalog: source/locales/*/LC_MESSAGES/c9-implement-security-logging-monitoring.po
Languages: ru

source: C9: Implement Security Logging and Monitoring
ru: C9: Внедрение журналирования и мониторинга событий безопасности

source: Description
ru: Описание

source: Logging is a concept that most developers already use for debugging and diagnostic purposes. Security logging is an equally basic concept: to log security information during the runtime operation of an application. Monitoring is the live review of application and security logs using various forms of automation. The same tools and patterns can be used for operations, debugging and security purposes.
ru: Большинство разработчиков уже используют журналирование при отладке и диагностике. Также важно регистрировать события безопасности (данные, связанные с обеспечением безопасности) во время работы приложения. Мониторинг — это "живой" анализ приложения и журналов безопасности с помощью различных средств автоматизации. Такие же инструменты и шаблоны могут применяться к выполняемым операциям, отладке и обеспечению безопасности.

source: Benefits of Security Logging
ru: Польза от журналирования событий безопасности

source: Security logging can be used for:
ru: Журналы регистрации событий безопасности могут быть использованы для:

source: Feeding intrusion detection systems
ru: снабжения системы обнаружения атак данными;

source: Forensic analysis and investigations
ru: анализа и расследования инцидентов;

source: Satisfying regulatory compliance requirements
ru: выполнения требований регулирующих органов.

source: Security Logging Implementation
ru: Реализация журналирования событий безопасности

source: The following is a list of security logging implementation best practices.
ru: Ниже представлены рекомендации по реализации журналирования событий безопасности.

source: Follow a common logging format and approach within the system and across systems of an organization. An example of a common logging framework is the Apache Logging Services which helps provide logging consistency between Java, PHP, .NET, and C++ applications.
ru: Используйте стандартные формы и способы регистрации событий в системе и между системами вашей организации. Примером стандартной платформы для регистрации событий являются службы журналирования Apache (Apache Logging Services), которые обеспечивают совместимость журналирования между приложениями на Java, PHP, .NET и C++.

source: Do not log too much or too little. For example, make sure to always log the timestamp and identifying information including the source IP and user-id, but be careful not to log private or confidential data.
ru: Не регистрируйте слишком много или слишком мало данных. Например, убедитесь в обязательной регистрации временных меток и идентификационных данных, таких как IP-адрес источника и идентификатор пользователя, но никогда не записывайте персональные или конфиденциальные данные.

source: Pay close attention to time syncing across nodes to ensure that timestamps are consistent.
ru: Обратите особое внимание на синхронизацию времени между узлами для обеспечения согласованности временных меток.

source: Logging for Intrusion Detection and Response
ru: Журналирование с целью обнаружения атак и противодействия им

source: Use logging to identify activity that indicates that a user is behaving maliciously. Potentially malicious activity to log includes:
ru: Используйте журналирование для определения активности, указывающей на вредоносный характер действий пользователя. Потенциально опасная активность, подлежащая регистрации:

source: Submitted data that is outside of an expected numeric range.
ru: вводимые данные находятся за пределами ожидаемого числового диапазона;

source: Submitted data that involves changes to data that should not be modifiable (select list, checkbox or other limited entry component).
ru: вводимые данные модифицируют компоненты, которые должны оставаться неизменными (список выбора, поля флажков, прочие компоненты с ограниченным вводом);

source: Requests that violate server-side access control rules.
ru: запросы, нарушающие правила управления доступом на стороне сервера;

source: A more comprehensive list of possible detection points is available `here <https://www.owasp.org/index.php/AppSensor_DetectionPoints>`_.
ru: более подробный список маркеров атак можно найти `здесь <https://www.owasp.org/index.php/AppSensor_DetectionPoints>`_.

source: When your application encounters such activity, your application should at the very least log the activity and mark it as a high severity issue. Ideally, your application should also respond to a possible identified attack, by for example invalidating the user’s session and locking the user's account. The response mechanisms allows the software to react in realtime to possible identified attacks.
ru: Когда приложение обнаруживает подобную активность, оно должно, как минимум, зарегистрировать это событие и отметить его как опасное. В идеале приложение должно оказать противодействие атаке, например, путем аннулирования сессии пользователя и блокировки его учетной записи. Механизм противодействия позволяет программе реагировать на обнаруживаемые атаки в реальном времени.

source: Secure Logging Design
ru: Разработка системы журналирования событий безопасности

source: Logging solutions must be built and managed in a secure way. Secure Logging design may include the following:
ru: Система журналирования должна создаваться и обслуживаться с учетом требований безопасности. Для обеспечения безопасности журналов рекомендуется:

source: Encode and validate any dangerous characters before logging to prevent `log injection <https://www.owasp.org/index.php/Log_Injection>`_ or `log forging <https://www.owasp.org/index.php/Log_Forging>`_ attacks.
ru: кодировать и проверять все потенциально опасные символы перед их записью в журнал для предотвращения `внедрения данных <https://www.owasp.org/index.php/Log_Injection>`_ или `подделки журналов <https://www.owasp.org/index.php/Log_Forging>`_;

source: Do not log sensitive information. For example, do not log password, session ID, credit cards, or social security numbers.
ru: отказаться от регистрации конфиденциальных данных, таких как пароли, идентификаторы сессий, номера кредитных карт или социального страхования;

source: Protect log integrity. An attacker may attempt to tamper with the logs. Therefore, the permission of log files and log changes audit should be considered.
ru: осуществлять контроль целостности журналов с целью предотвращения несанкционированных действий с ними через аудит разрешений на работу с файлами журналов и прав на их изменение;

source: Forward logs from distributed systems to a central, secure logging service. This will sure log data cannot be lost if one node is compromised. This also allows for centralized monitoring.
ru: отправлять журналы регистрации от распределенных систем в центральную, безопасную службу журналирования. Это обеспечит сохранность журналируемых данных при компрометации отдельных узлов, а также централизованность мониторинга.

source: References
ru: Ссылки

source: `OWASP AppSensor Detection Points <https://www.owasp.org/index.php/AppSensor_DetectionPoints>`_ - Detection points used to identify a malicious user probing for vulnerabilities or weaknesses in application.
ru: `Маркеры атак OWASP AppSensor <https://www.owasp.org/index.php/AppSensor_DetectionPoints>`_ — используются для определения попыток злоумышленника обнаружить в приложении уязвимости или недостатки

source: `OWASP Log injection <https://www.owasp.org/index.php/Log_Injection>`_
ru: `OWASP - Внедрение данных в журналы <https://www.owasp.org/index.php/Log_Injection>`_

source: `OWASP Log forging <https://www.owasp.org/index.php/Log_Forging>`_
ru: `OWASP - Подделка журналов <https://www.owasp.org/index.php/Log_Forging>`_

source: `OWASP Cheat Sheet: Logging <https://www.owasp.org/index.php/Logging_Cheat_Sheet>`_ How to properly implement logging in an application
ru: `Памятка OWASP: Журналирование <https://www.owasp.org/index.php/Logging_Cheat_Sheet>`_ — как правильно реализовать журналирование в приложении

source: `OWASP Development Guide: Logging <https://www.owasp.org/index.php/Error_Handling,_Auditing_and_Logging#Logging>`_
ru: `Руководство разработчика OWASP: Журналирование <https://www.owasp.org/index.php/Error_Handling,_Auditing_and_Logging#Logging>`_

source: `OWASP Code Review Guide: Reviewing Code for Logging Issues <https://www.owasp.org/index.php/Reviewing_Code_for_Logging_Issues>`_
ru: `Руководство OWASP по анализу кода: Выявление ошибок журналирования в коде <https://www.owasp.org/index.php/Reviewing_Code_for_Logging_Issues>`_

source: Tools
ru: Инструменты

source: `OWASP Security Logging Project <https://www.owasp.org/index.php/OWASP_Security_Logging_Project>`_
ru: `Проект OWASP: Журналирование событий безопасности <https://www.owasp.org/index.php/OWASP_Security_Logging_Project>`_

source: `Apache Logging Services <https://logging.apache.org/>`_
ru: `Службы журналирования Apache <https://logging.apache.org/>`_
