Repository: owasp-russia/top-10-proactive-controls
Catalog: source/locales/*/LC_MESSAGES/foreword.po
Languages: ru

source: FOREWORD
ru: Предисловие

source: Insecure software is undermining our financial, healthcare, defense, energy, and other critical infrastructure worldwide. As our digital, global infrastructure gets increasingly complex and interconnected, the difficulty of achieving application security increases exponentially. We can no longer afford to tolerate relatively simple security problems.
ru: Ненадежное программное обеспечение подрывает безопасность критических инфраструктур, относящихся, например, к здравоохранению, обороне, энергетике или финансам. Наша цифровая, глобальная инфраструктура становится сложнее, взаимосвязей между ее компонентами становится все больше, поэтому важность обеспечения безопасности приложений возрастает экспоненциально. Больше нельзя оставлять без должного внимания относительно простые угрозы безопасности.

source: AIM & OBJECTIF
ru: Цели и задачи

source: The goal of the *OWASP Top 10 Proactive Controls project* (OPC) is to raise awareness about application security by describing the most important areas of concern that software developers must be aware of. We encourage you to use the OWASP Proactive Controls to get your developers started with application security. Developers can learn from the mistakes of other organizations. We hope that the OWASP Proactive Controls is useful to your efforts in building secure software.
ru: Целью проекта "Топ-10 OWASP: Проактивная защита" является привлечение внимания к безопасности приложений, путем рассмотрения наиболее важных аспектов безопасности, на которые разработчикам ПО стоит обращать внимание. Мы призываем организации воспользоваться рекомендациями OWASP по проактивной защите и научить разработчиков обращать внимание на безопасность приложений, принимая во внимание ошибки, имевшие место в других организациях. Надеемся, что рекомендации OWASP окажутся полезными при создании вами безопасных приложений.

source: CALL TO ACTION
ru: Призыв к действию

source: Please don’t hesitate to contact the OWASP Proactive Control project with your questions, comments, and ideas, either publicly to our email list or privately to `jim@owasp.org <mailto:jim@owasp.org>`_.
ru: Все вопросы, комментарии и идеи вы можете отправлять в общий список рассылки или на адрес электронной почты `jim@owasp.org <mailto:jim@owasp.org>`_.

source: COPYRIGHT AND LICENSE
ru: Авторские права и Лицензирование

source: This document is released under the Creative Commons Attribution ShareAlike 3.0 license. For any reuse or distribution, you must make it clear to others the license terms of this work.
ru: Данный документ выпущен под лицензией Creative Commons Attribution ShareAlike 3.0. В случае переиспользования или распространения данного документа необходимо указывать условия лицензионного соглашения, действующие в его отношении.

source: PROJECT LEADERS
ru: Руководители проекта

source: Katy Anton
ru: Кэйти Энтон (Katy Anton)

source: Jim Bird
ru: Джим Бёрд (Jim Bird)

source: Jim Manico
ru: Джим Манико (Jim Manico)

source: CONTRIBUTORS
ru: Участники проекта

source: Chris Romeo
ru: Крис Ромио (Chris Romeo)

source: Dan Anderson
ru: Ден Андерсон (Dan Anderson)

source: David Cybuck
ru: Дэвид Сайбак (David Cybuck)

source: Dave Ferguson
ru: Дейв Фергюсон (Dave Ferguson)

source: Josh Grossman
ru: Джош Гроссман (Josh Grossman)

source: Osama Elnaggar
ru: Осама Эльнаггар (Osama Elnaggar)

source: Colin Watson
ru: Колин Уотсон (Colin Watson)

source: Rick Mitchell
ru: Рик Митчелл (Rick Mitchell)

source: And many more…
ru: И многие другие…
