Repository: owasp-russia/top-10-proactive-controls
Catalog: source/locales/*/LC_MESSAGES/introduction.po
Languages: ru

source: INTRODUCTION
ru: ВВЕДЕНИЕ

source: The OWASP Top Ten Proactive Controls 2018 is a list of security techniques that should be considered for every software development project. This document is written for developers to assist those new to secure development.
ru: "Проактивная защита OWASP: Топ-10 рекомендаций 2018" представляет собой перечень методик по обеспечению безопасности и рекомендуется к использованию во всех проектах разработки ПО. Этот документ написан для разработчиков, еще не знакомых с безопасным программированием.

source: One of the main goals of this document is to provide concrete practical guidance that helps developers build secure software. These techniques should be applied proactively at the early stages of software development to ensure maximum effectiveness.
ru: Одной из основных целей данного документа является создание практического руководства, позволяющего разработчикам создавать безопасное программное обеспечение. Приводимые в документе техники необходимо применять проактивно, на ранних стадиях разработки, для достижения максимальной эффективности.

source: The Top 10 Proactive Controls
ru: Топ-10 рекомендаций по проактивной защите

source: The list is ordered by importance with list item number 1 being the most important:
ru: Рекомендации в списке располагаются по степени их важности, в пункте 1 указана самая важная из них:

source: C1: Define Security Requirements
ru: C1: Определение требований безопасности

source: C2: Leverage Security Frameworks and Libraries
ru: C2: Использование безопасных фреймворков и библиотек

source: C3: Secure Database Access
ru: C3: Обеспечение безопасного доступа к базам данных

source: C4: Encode and Escape Data
ru: C4: Кодирование и экранирование данных

source: C5: Validate All Inputs
ru: C5: Обязательная проверка всех входных данных

source: C6: Implement Digital Identity
ru: C6: Внедрение цифровых идентификаторов

source: C7: Enforce Access Controls
ru: C7: Обязательный контроль доступа

source: C8: Protect Data Everywhere
ru: C8: Повсеместная защита данных

source: C9: Implement Security Logging and Monitoring
ru: C9: Внедрение журналирования и мониторинга событий безопасности

source: C10: Handle All Errors and Exceptions
ru: C10: Обязательная обработка всех ошибок и исключений

source: How this List Was Created
ru: Как создавался список рекомендаций

source: This list was originally created by the current project leads with contributions from several volunteers. The document was then shared globally so even anonymous suggestions could be considered. Hundreds of changes were accepted from this open community process.
ru: Изначально данный список был составлен текущими руководителями проекта с участием нескольких добровольцев. Затем документ был опубликован в открытом доступе, чтобы даже анонимные пользователи могли вносить свои предложения. Сотни изменений были приняты на основе предложений, поступивших от сообщества.

source: Target Audience
ru: Целевая аудитория

source: This document is primarily written for developers. However, development managers, product owners, Q/A professionals, program managers, and anyone involved in building software can also benefit from this document.
ru: Документ предназначается прежде всего разработчикам. Однако, руководители разработки, менеджеры продуктов, специалисты по обеспечению качества, руководители проектов, а также остальные участники процесса создания программного обеспечения могут почерпнуть полезную информацию из данного документа.

source: How to Use this Document
ru: Как пользоваться документом

source: This document is intended to provide initial awareness around building secure software. This document will also provide a good foundation of topics to help drive introductory software security developer training. These controls should be used consistently and thoroughly throughout all applications. However, this document should be seen as a starting point rather than a comprehensive set of techniques and practices. A full secure development process should include comprehensive requirements from a standard such as the OWASP ASVS in addition to including a range of software development activities described in maturity models such as `OWASP SAMM <https://www.owasp.org/index.php/OWASP_SAMM_Project>`_ and `BSIMM <https://www.bsimm.com/>`_.
ru: Документ предназначен для ознакомления с основами разработки безопасного программного обеспечения, а также содержит хорошую подборку материалов, позволяющую создавать вводные курсы по безопасности ПО для разработчиков. Приведенные в документе рекомендации необходимо выполнять последовательно и в полной мере для всех без исключения приложений. Тем не менее, данный документ стоит рассматривать скорее как отправную точку, а не как исчерпывающий набор методов и практик. Полноценный процесс безопасной разработки должен включать в себя разносторонние требования из стандартов, подобных "Стандарту подтверждения безопасности приложений OWASP (ASVS)", а также предусматривать мероприятия по разработке ПО, описанные в моделях зрелости, таких как `OWASP SAMM (Модель обеспечения безопасности ПО) <https://www.owasp.org/index.php/OWASP_SAMM_Project>`_ и `BSIMM (Сводная модель обеспечения безопасности ПО) <https://www.bsimm.com/>`_..

source: Link to the OWASP Top 10 Project
ru: Связь с проектом Топ-10 OWASP

source: The OWASP Top 10 Proactive Controls is similar to the `OWASP Top 10 <https://www.owasp.org/index.php/Category:OWASP_Top_Ten_Project>`_ but is focused on defensive techniques and controls as opposed to risks. Each technique or control in this document will map to one or more items in the *risk based* OWASP Top 10. This mapping information is included at the end of each control description.
ru: Проект "Топ-10 OWASP: Проактивная защита" аналогичен проекту `"Топ-10 OWASP"<https://www.owasp.org/index.php/Category:OWASP_Top_Ten_Project>`_, но акцент делается на методах и рекомендациях по защите от угроз, а не на самих угрозах. Каждый метод и рекомендация в данном документе связаны с одной или несколькими угрозами из списка Топ-10 OWASP. Информация о связях приводится в конце описания каждого требования.
