Repository: owasp-russia/top-10-proactive-controls
Catalog: source/locales/*/LC_MESSAGES/structure.po
Languages: ru

source: DOCUMENT STRUCTURE
ru: СТРУКТУРА ДОКУМЕНТА

source: This document is structured as a list of security controls. Each control is described as follows:
ru: Данный документ представлен в виде списка требований к безопасности. Каждое требование описывается следующим образом:

source: Cx: Control Name
ru: Cx: Название требования

source: Description
ru: Описание

source: A detailed description of the control including some best practices to consider.
ru: Подробное описание требования, включая некоторые рекомендации.

source: Implementation
ru: Реализация

source: Implementation best practices and examples to illustrate how to implement each control.
ru: Рекомендации по реализации и примеры, иллюстрирующие способы реализации каждого требования.

source: Vulnerabilities Prevented
ru: Предотвращаемые уязвимости

source: List of prevented vulnerabilities or risks addressed (OWASP TOP 10 Risk, CWE, etc.)
ru: Список предотвращаемых уязвимостей или угроз (например, Топ-10 угроз OWASP или CWE).

source: References
ru: Ссылки

source: List of references for further study (OWASP Cheat sheet, Security Hardening Guidelines, etc.)
ru: Перечень справочных источников для дальнейшего изучения (например, памятки OWASP или руководства по улучшению безопасности).

source: Tools
ru: Инструменты

source: Set of tools/projects to easily introduce/integrate security controls into your software.
ru: Перечень инструментов или проектов, позволяющих реализовать или интегрировать требования безопасности в ПО.
